{"Beedie School of Business - Simon Fraser University": {"id_": "8", "university_name": "Beedie School of Business - Simon Fraser University", "abbreviation": "SFU Beedie", "website": "https://beedie.sfu.ca/", "wikipedia": "https://en.wikipedia.org/wiki/Beedie_School_of_Business", "university_type": "Public University", "graduation_year": "4", "location": "Burnaby, British Columbia, Canada\nVancouver, British Columbia, Canada\nSurrey, British Columbia, Canada", "graduation_rate": "89", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "domestic_student_tuition": "CAD $1,066.44", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "description": "The Beedie School of Business at Simon Fraser University, located in British Columbia, Canada, is recognized as one of Canada's leading business schools. Established when Simon Fraser University was founded in 1965, the business discipline became its own faculty by 1982. The school offers a range of undergraduate and graduate programs, including Canada's first Executive MBA program launched in 1968. SFU Beedie is noted for its dynamic teaching environment and significant contributions to global-class research, particularly in the knowledge economy. The school operates across multiple campuses in the Lower Mainland and is accredited by the AACSB and recognized with an EQUIS Quality award from EFMD. It actively promotes collaboration between its faculty, researchers, and both business and community partners.", "ranking_arwu_rank_2023": "", "important_calendar": "https://beedie.sfu.ca/programs/undergraduate/academic-calendar", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "faculty": "", "popular_programs": "Finance and Accounting Programs", "programs": "MSc Finance\nOnline MBA\nEarly Career MBA\nFull-Time MBA\nPart-Time MBA\nExecutive MBA\nGraduate Diploma in Business Administration", "others": "", "characteristics": "Beedie School of Business at Simon Fraser University is recognized for its strong academic research, ranking among the top 100 business schools globally. The school emphasizes collaborative partnerships with both the academic and business communities, enhancing its educational and research initiatives.\nAccredited by the Association to Advance Collegiate Schools of Business (AACSB) and awarded the EQUIS Quality label from the European Federation for Management Development (EFMD), Beedie maintains high standards in business education.\nThe school offers a range of programs including Canada's first Executive MBA, demonstrating its pioneering approach in business education. With a focus on producing socially responsible business leaders with a global perspective, Beedie integrates innovative teaching methods and real-world experiences in its curriculum, preparing students for leadership roles in various industries."}}
{"Haskayne School of Business - University of Calgary": {"id_": "54", "university_name": "Haskayne School of Business - University of Calgary", "abbreviation": "UCalgary", "website": "https://haskayne.ucalgary.ca/", "wikipedia": "https://en.wikipedia.org/wiki/Haskayne_School_of_Business", "university_type": "Public University", "graduation_year": "4", "graduation_rate": "89", "domestic_student_tuition": "CAD $7,210.90 / CAD $5,593.50 - $8,828.30", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "location": "Calgary, Alberta, Canada", "ranking_us_news_2023": "", "description": "The Haskayne School of Business is part of the University of Calgary in Alberta, Canada. It offers a range of programs including Bachelor of Commerce, MBA, and PhD degrees, focusing on business education and research. The school is known for its strong emphasis on ethical leadership and sustainable business practices. It also provides various executive education programs and has connections with the business community to enhance learning through practical experience.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://haskayne.ucalgary.ca/important-dates", "statistics": "Undergraduate Programs: 24\nMaster's Programs: 7\nPhD Programs: 1", "faculty": "", "popular_programs": "Bachelor of Commerce\nMaster of Management\nExecutive MBA\nPhD programs", "programs": "Bachelor of Commerce\nMaster of Management\nDaytime MBA\nEvening MBA\nAccounting (ACCT)\nBusiness (BUSI)\nBusiness Analytics (BANA)\nBusiness Technology Management (BTMA)", "others": "AACSB accredited since 1985", "characteristics": "The Haskayne School of Business is accredited by the Association to Advance Collegiate Schools of Business (AACSB International), a recognition of excellence in business education held by only 5 percent of the world's schools offering business degrees. Haskayne has maintained this prestigious accreditation since 1985.\nThe school was founded in 1967 and named in honor of Richard F. Haskayne in 2002, reflecting its deep connections to local business leadership and history.\nHaskayne offers a range of programs including bachelor's, master's, doctorate, and executive education, catering to nearly 4,000 full- and part-time students and over 1,000 executive education participants.\nThe Haskayne Master of Management is a 10-month full-time program designed for recent graduates with non-business bachelor's degrees, emphasizing the school's focus on providing practical, accelerated business education.\nThe school's strategic vision, Haskayne 2025, highlights its commitment to being an internationally recognized, research-based, student-focused center of excellence, despite resource limitations, showcasing its dedication to strategic innovation and excellence."}}
{"Lambton College (Toronto Campus/Cestar College)": {"id_": "67", "university_name": "Lambton College (Toronto Campus/Cestar College)", "abbreviation": "LC", "website": "https://www.lambtoncollege.ca", "wikipedia": "https://en.wikipedia.org/wiki/Lambton_College", "university_type": "private college", "graduation_year": "4", "location": "Sarnia, Ontario, Canada\nToronto, Ontario, Canada\nMississauga, Ontario, Canada", "graduation_rate": "89%", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "description": "Lambton College in Toronto, operated by Cestar College as a public-private partnership, offers specialized programs primarily focused on business, technology, and healthcare. This campus provides a practical and personalized approach to education, aimed at meeting the needs of its diverse student body and preparing them for career success in their respective fields.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://www.lambtoncollege.ca/international/toronto/important-dates", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "faculty": "", "popular_programs": "Mobile App Development\nLaw\nPersonal Care", "programs": "Advanced Project Management and Strategic Leadership\nArtificial Intelligence and Machine Learning\nBusiness Management\nCloud Computing for Big Data\nConstruction Project Management\nCyber Security and Computer Forensics\nData Science and Advanced Analytics\nEmbedded Systems Development\nEnterprise Project Management\nFinancial Planning and Wealth Management\nGame Design and Development\nHospitality and Tourism Management\nHuman Resources Management\nInformation Technology Professional\nMobile Application Design and Development\nNetwork Security\nOccupational Health and Safety Management\nOperations Management\nPower Engineering Techniques\nQuality Engineering Management\nSupply Chain Management\nWeb Design and Development\nWireless Networking", "others": "", "characteristics": "Lambton College in Toronto, operated by Cestar College, offers a diverse range of program options catering to various types of students including domestic applicants, international applicants, apprentices, and online education students. The college provides a supportive environment for international students, guiding them through necessary procedures upon arrival in Canada, such as presenting relevant documents to border services and ensuring they understand the conditions of their study permit.\n\nThe Toronto campus of Lambton College, located at 265 Yorkland Blvd, Toronto, ON, is part of a broader network that acknowledges and respects its location on the traditional territory of the Ojibwe, Potawatomi, and Odawa Nations. This acknowledgment reflects the college's recognition of the historical and ongoing contributions of indigenous communities to the area.\n\nLambton College has implemented significant health and safety measures across its campuses, including becoming a smoke-free environment and adjusting its policies on masks and vaccines in response to the evolving public health landscape. These measures demonstrate the college's commitment to maintaining a safe and conducive learning environment.\n\nAdditionally, Lambton College's partnership with Cestar College in Toronto allows students to receive full credit from Lambton College for courses completed at the Toronto campus, ensuring a seamless educational experience that emphasizes both practical skills and academic rigor."}}
{"Rotman School of Management - University of Toronto": {"id_": "113", "university_name": "Rotman School of Management - University of Toronto", "abbreviation": "UofT Rotman", "website": "https://www.rotman.utoronto.ca/", "wikipedia": "https://en.wikipedia.org/wiki/Rotman_School_of_Management", "university_type": "Public University", "graduation_year": "2", "location": "Toronto, Ontario, Canada", "graduation_rate": "89", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $46,270", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "description": "The Rotman School of Management is the graduate business school of the University of Toronto, located in downtown Toronto. It offers a range of MBA and finance-related programs, including a full-time MBA, a part-time MBA, an Executive MBA, and a Global Executive MBA. Rotman is known for its innovative curriculum designed around Integrative Thinking and Business Design. It is recognized as one of the top business schools in Canada and has a strong reputation for research and the quality of its academic programs.", "ranking_arwu_rank_2023": "", "important_calendar": "https://www.rotman.utoronto.ca/Degrees/AcademicCalendar", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "faculty": "Finance\nAccounting\nMarketing\nOperations Management\nEconomic Analysis and Policy\nBusiness Operations and Analytics", "popular_programs": "MBA (Full-Time MBA, Morning MBA, Evening MBA, Executive MBA, Omnium Global Executive MBA)\nJD/MBA\nMBA/Master of Global Affairs\nSkoll BASc/MBA\nMaster of Finance\nMaster of Management Analytics", "programs": "Full-Time MBA\nMorning MBA\nEvening MBA\nExecutive MBA\nOmnium Global Executive MBA\nJD/MBA\nMBA/Master of Global Affairs\nSkoll BASc/MBA\nMaster of Finance\nMaster of Financial Risk Management\nGraduate Diploma in Professional Accounting\nExecutive Coaching Certificate", "characteristics": "The Rotman School of Management at the University of Toronto is recognized as Canada's top-ranked business school. It offers a wide array of professional degree programs and is known for its innovative curriculum that includes Integrative ThinkingTM and Business DesignTM. Located in the heart of Toronto, North America's third-largest financial center, Rotman provides its students with unparalleled opportunities for learning and professional growth. The school is a catalyst for transformative learning, research, and public engagement, aiming to create value for both business and society.", "others": ""}}
{"Simon Fraser University": {"id_": "129", "university_name": "Simon Fraser University", "abbreviation": "SFU", "website": "https://www.sfu.ca", "wikipedia": "https://en.wikipedia.org/wiki/Simon_Fraser_University", "university_type": "Public University", "graduation_year": "4", "location": "Burnaby, British Columbia, Canada\nVancouver, British Columbia, Canada\nSurrey, British Columbia, Canada", "graduation_rate": "0.89", "domestic_student_tuition": "CAD $448.17", "international_student_tuition": "CAD $17,514", "ranking_qs_news_2024": "318", "ranking_us_news_2023": 317.0, "ranking_times_rank_2024": "251–300", "ranking_arwu_rank_2023": "301-400", "description": "Simon Fraser University (SFU), a public research university located in British Columbia, Canada, features three campuses within the Greater Vancouver area, with its main campus in Burnaby. It is recognized for its research-intensive focus and consistently ranks among Canada's top universities. SFU is noted for its commitment to sustainability, innovative research, and preparing students to meet the demands of today's workforce. The university actively engages with communities and organizations to foster knowledge that enhances societal well-being.", "important_calendar": "https://www.sfu.ca/students/deadlines/academic_dates.html", "statistics": "Undergraduate Programs: 99\nMaster's Programs: 51\nPhD Programs: 33", "faculty": "Applied Science, Faculty of\nArts and Social Sciences, Faculty of\nBeedie School of Business\nCommunication, Art and Technology, Faculty of\nEducation, Faculty of\nEnvironment, Faculty of\nHealth Sciences, Faculty of\nScience, Faculty of", "popular_programs": "Beedie School of Business\nEngineering Science Program\nSustainable Energy Engineering Program\nStatistics Program\nPsychology Program", "programs": "Accounting (Business)\nActuarial Science\nBehavioural Neuroscience\nBiological Anthropology\nChemical Physics\nChemistry\nAfrican Studies\nAnthropology\nApplied Physics\nArchaeology\nArt, Performance and Cinema Studies\nArts Education", "others": "", "characteristics": "Simon Fraser University (SFU) is recognized for its strong emphasis on research, community engagement, and sustainability. Here are some key characteristics:\n\nResearch Intensive: SFU is consistently ranked among Canada's top research-intensive universities, demonstrating a robust commitment to research and knowledge development.\n\nCommunity Engagement: The university actively forges lasting partnerships that enhance the social, economic, and cultural well-being of the communities it serves.\n\nSustainability Leadership: SFU is a world leader in sustainability, integrating this principle into its operations and academic programs to foster a sustainable future.\n\nRespect for Indigenous Territories: SFU acknowledges and respects the unceded traditional territories of various Indigenous peoples where its campuses are located, reflecting its commitment to recognizing and honoring local Indigenous communities.\n\nRapid Growth and Expansion: Since its establishment in 1965, SFU has quickly grown to accommodate over 30,000 students and has developed a significant alumni network, illustrating its rapid expansion and influence in higher education."}}
{"St. Clair College (Toronto Campus/Ace Acumen College)": {"id_": "135", "university_name": "St. Clair College (Toronto Campus/Ace Acumen College)", "abbreviation": "SCC", "website": "https://www.stclaircollege.ca", "wikipedia": "https://en.wikipedia.org/wiki/St._Clair_College", "graduation_year": "2", "location": "Windsor, Ontario, Canada\nToronto, Ontario, Canada", "university_type": "public college", "domestic_student_tuition": "CAD $6,128 - $7,946", "graduation_rate": "89", "international_student_tuition": "CAD $7,805.25", "ranking_qs_news_2024": "", "description": "St. Clair College (Toronto Campus/Ace Acumen College) is a branch of St. Clair College of Applied Arts and Technology, which is one of the leading colleges in Ontario, Canada. The Toronto campus, operated in partnership with Ace Acumen Academy, offers high-quality education primarily to international students, providing programs in business, social services, and technology. The campus focuses on practical skills and career-oriented education, preparing students for the global job market.", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "popular_programs": "Health\nBusiness and IT\nMedia Arts\nSocial Services\nTechnology and Trades", "faculty": "", "characteristics": "St. Clair College (Toronto Campus/Ace Acumen College) is known for its practical and skills-oriented education. The college offers a variety of diploma and certificate programs that focus on job-ready skills. The Toronto Campus, specifically operated in partnership with Ace Acumen Academy, provides a unique educational environment tailored to international students, offering programs in business, technology, and health sciences. This campus is characterized by its small class sizes, experienced faculty, and a focus on practical training that prepares students for the workforce.", "programs": "Bachelor of Science in Nursing\nBoard of Governors Certificate\nHonours Bachelor Degree\nOntario College Advanced Diploma\nOntario College Certificate\nAdvanced Medical Esthetics Practitioner\nChild and Youth Care\nCICE\nHonours Bachelor of Applied Arts in Social Justice & Legal Studies", "others": ""}}
{"University of Calgary": {"id_": "159", "university_name": "University of Calgary", "abbreviation": "UofC", "website": "https://www.ucalgary.ca", "wikipedia": "https://en.wikipedia.org/wiki/University_of_Calgary", "university_type": "Public University", "graduation_year": "4", "location": "Calgary, Alberta, Canada\nDoha, Ad-Dawhah, Qatar", "graduation_rate": "0.89", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "182", "ranking_us_news_2023": 175.0, "ranking_times_rank_2024": "201–250", "description": "The University of Calgary, located in Calgary, Alberta, Canada, is a public research university. It was established in 1966 after splitting from the University of Alberta. The university is a member of the U15 Group of Canadian Research Universities and offers a wide range of academic programs through its various faculties and schools. The University of Calgary is known for its high research activity and its strong programs in fields such as engineering, health sciences, and business.", "ranking_arwu_rank_2023": "201-300", "important_calendar": "https://calendar.ucalgary.ca/acadsched", "statistics": "Undergraduate Programs: 99\nMaster's Programs: 76\nPhD Programs: 59", "faculty": "Arts, Faculty of\nScience, Faculty of\nGraduate Studies, Faculty of\nSocial Work, Faculty of\nCreative and Performing Arts, School of\nNursing, Faculty of", "popular_programs": "Nursing Program\nEngineering Program\nSustainability Program", "programs": "Doctor of Philosophy - Environmental Design (PhD)\nEngineering (common first year)\nBachelor of Education\nComputer Science", "others": "", "characteristics": "The University of Calgary is a leading research university located in the heart of Southern Alberta. It is known for its commitment to acknowledging and paying tribute to the traditional territories of the peoples of Treaty 7. The university educates over 34,000 students, including more than 26,000 undergraduates and 8,000 graduate students, and boasts a high graduate employment rate. UCalgary is also recognized for its significant number of Academic All-Canadian student-athletes, highlighting its blend of academic and athletic excellence. Additionally, the university offers a diverse range of programs and has different academic schedules for various professional degrees, catering to a broad spectrum of academic interests and career aspirations."}}
{"University of Guelph": {"id_": "162", "university_name": "University of Guelph", "abbreviation": "U of G", "website": "https://www.uoguelph.ca", "wikipedia": "https://en.wikipedia.org/wiki/University_of_Guelph", "university_type": "Public University", "graduation_year": "4", "graduation_rate": "89", "domestic_student_tuition": "CAD $6,091 - $9,730", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": 497.0, "description": "The University of Guelph, located in Guelph, Ontario, Canada, is a comprehensive public research university. It was established in 1964 after the amalgamation of the Ontario Agricultural College, the MacDonald Institute, and the Ontario Veterinary College. The university offers a wide range of undergraduate and graduate programs in fields such as arts, sciences, and business. Known for its commitment to student experience, innovative research, and community involvement, the University of Guelph also emphasizes sustainability and global understanding. It is a member of the U15, a group of research-intensive universities in Canada.", "ranking_times_rank_2024": "401–500", "location": "Guelph, Ontario, Canada\nRidgetown, Ontario, Canada", "ranking_arwu_rank_2023": "501-600", "important_calendar": "https://www.uoguelph.ca/registrar/calendars/undergraduate", "statistics": "Undergraduate Programs: 99\nMaster's Programs: 48\nPhD Programs: 36", "popular_programs": "Education Program\nSauder Business School\nEngineering Program", "faculty": "College of Arts\nCollege of Biological Science\nCollege of Social and Applied Human Sciences\nGordon S. Lang School of Business and Economics\nOntario Agricultural College\nOntario Veterinary College", "programs": "Bachelor of Science\nAccounting\nMaster's programs\nDoctoral programs", "others": "", "characteristics": "The University of Guelph is recognized as one of Canada's top comprehensive and research-intensive universities, often referred to as Canada's Food University. It was established in 1964 and has a history of excellence that dates back over 150 years through its founding colleges. The university is known for its commitment to developing exceptional thinkers and engaged citizens, with a strong emphasis on experiential learning and co-operative education. The campus features 20 dining facilities, 13 coffee houses, and more than 3,000,000 bricks in its walkways, symbolizing its expansive and welcoming physical environment. The Gryphon, representing strength and wisdom, is the university's mascot."}}
{"University of Toronto": {"id_": "178", "university_name": "University of Toronto", "abbreviation": "UofT", "website": "https://www.utoronto.ca", "wikipedia": "https://en.wikipedia.org/wiki/University_of_Toronto", "university_type": "Public University", "graduation_year": "4", "location": "Toronto, Ontario, Canada\nMississauga, Ontario, Canada\nScarborough, Ontario, Canada", "graduation_rate": "79%", "domestic_student_tuition": "CAD $6,100 - $15,760", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "21", "ranking_us_news_2023": 18.0, "ranking_times_rank_2024": "21", "ranking_arwu_rank_2023": "24", "description": "The University of Toronto, located in Toronto, Ontario, Canada, is a public research university and a member of the U15 Group of Canadian Research Universities. It was founded by royal charter in 1827 as King's College, the first institution of higher learning in the colony of Upper Canada. The university comprises eleven colleges, each with substantial autonomy on financial and institutional affairs. It has two satellite campuses located in Scarborough and Mississauga. The University of Toronto is well known for its influential movements and curricula in literary criticism and communication theory, and notably for the development of the first electron microscope, the development of deep learning, multi-touch technology, the identification of the first black hole Cygnus X-1, and research in insulin.", "important_calendar": "https://artsci.calendar.utoronto.ca/", "statistics": "Undergraduate Programs: 700\nMaster's Programs: 200\nPhD Programs: 200", "programs": "Accounting, Actuarial Science, Aerospace Engineering, African Studies, Animal Physiology, Anthropology, Applied Mathematics, Architectural Studies, Art History, Asian Canadian Studies, Asian Geography, Astronomy and Astrophysics, Biochemistry, Biodiversity and Conservation Biology, Bioethics, Bioinformatics, Biological Chemistry, Biological Physics, Biology, Biomedical Communications, Biomedical Engineering, Biomedical Toxicology, Biotechnology, Book and Media Studies, Buddhism, Psychology and Mental Health, Business Administration, Canadian Studies, Caribbean Studies, Cell and Molecular Biology, Celtic Studies, Chemical Engineering, Chemical Physics, Chemistry, Christianity and Culture, Cinema Studies, Civil Engineering, Classical Civilization, Cognitive Science, Commerce, Computer Engineering, Computer Science, Contemporary Asian Studies, Criminology and Sociolegal Studies, Diaspora and Transnational Studies, Digital Enterprise Management, Drama, Earth and Environmental Systems, Earth Science, East Asian Studies, Ecology and Evolutionary Biology, Economics, Education, Electrical Engineering, Employment Relations, Energy Policy and Management, Engineering Science, English, Environmental Biology, Environmental Chemistry, Environmental Ethics, Environmental Geoscience, Environmental Health, Environmental Physics, Environmental Science, Environmental Studies, Ethics, Society and Law, European Studies, European Union Studies, Finance, Financial Economics, Forest Conservation, Forest Conservation Science, French, Gender and Equity Studies, Geography, Geology, Geomatics Engineering, German, Global Affairs, Global Asia Studies, Global Health, Greek, Health and Disease, Health Care Ethics, Health Policy, Management and Evaluation, History, History and Philosophy of Science and Technology, Human Biology, Human Geography, Humanities, Immunology, Indigenous Studies, Industrial Engineering, Industrial Relations and Human Resources, Information Security, International Development Studies, International Relations, Italian, Jewish Studies, Kinesiology and Physical Education, Latin, Latin American Studies, Linguistics, Literature and Critical Theory, Management, Management and International Business, Materials Engineering, Materials Science, Mathematical Applications in Economics and Finance, Mathematics, Mechanical Engineering, Media Studies, Medical Radiation Sciences, Medieval Studies, Mental Health Studies, Microbiology, Mineral Engineering, Molecular Biology, Molecular Genetics, Music, Music History and Culture, Near and Middle Eastern Civilizations, Neuroscience, New Media Studies, Nursing, Nutritional Sciences, Peace, Conflict and Justice, Pharmaceutical Chemistry, Pharmacology, Pharmacy, Philosophy, Physical and Environmental Geography, Physical and Mathematical Sciences, Physics, Physiology, Planetary Science, Political Science, Portuguese, Psychology, Public Policy, Religion, Renaissance Studies, Rotman Commerce, Science and Society, Sexual Diversity Studies, Slavic Languages and Literatures, Social Sciences, Sociology, South Asian Studies, Spanish, Statistical Sciences, Statistics, Sustainability, Theatre and Performance, Urban Studies, Visual Studies, Women and Gender Studies, Zoology", "popular_programs": "Arts and Humanities\nEngineering & Technology\nLaw\nSports-related subjects\nData Science\nEducation\nNursing\nAnatomy and Physiology", "faculty": "Faculty of Arts and Science\nFaculty of Applied Science and Engineering\nFaculty of Architecture, Landscape, and Design\nFaculty of Music\nFaculty of Forestry\nFaculty of Information\nFaculty of Medicine\nFaculty of Nursing\nFaculty of Pharmacy\nFaculty of Dentistry\nFaculty of Kinesiology and Physical Education\nDalla Lana School of Public Health\nFactor-Inwentash Faculty of Social Work\nRotman School of Management\nSchool of Graduate Studies\nSchool of Continuing Studies", "others": "", "characteristics": "The University of Toronto is a global leader in research and teaching and has a significant footprint, both in Canada and around the world. The University of Toronto library system is Canada’s largest research library system, and the third largest in North America. It includes over 12 million volumes in 341 languages, 1,500,000 electronic resources in various formats, 28,000 linear metres of archival material, and 500 terabytes of data. The university offers over 700 undergraduate programs in diverse fields such as Humanities & Social Sciences, Life Sciences, Physical & Mathematical Sciences, Commerce & Management, Computer Science, Engineering, Kinesiology & Physical Education, Music, and Architecture. U of T's commitment to innovation is highlighted by its Intellectual Property Education Program available to all students, staff, and faculty. The university's three campuses each serve as comprehensive centers for teaching and research, contributing to the continuous economic transformation of the Toronto region and creating prosperity in Canada and beyond."}}
{"University of Waterloo": {"id_": "181", "university_name": "University of Waterloo", "abbreviation": "UW", "website": "https://uwaterloo.ca", "wikipedia": "https://en.wikipedia.org/wiki/University_of_Waterloo", "university_type": "Public University", "graduation_year": "4", "location": "Waterloo, Ontario, Canada\nCambridge, Ontario, Canada\nKitchener, Ontario, Canada\nStratford, Ontario, Canada", "graduation_rate": "89", "domestic_student_tuition": "CAD $8,000 - $9,000", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "112", "ranking_us_news_2023": 191.0, "ranking_times_rank_2024": "=158", "ranking_arwu_rank_2023": "151-200", "description": "The University of Waterloo, located in Waterloo, Ontario, Canada, is a public research university. It is renowned for its cooperative education (co-op) programs, which are the largest of their kind in the world, allowing students to integrate their education with relevant work experiences. Waterloo is a member of the U15, a group of research-intensive universities in Canada. Known for its strong focus on engineering, computer science, and mathematics, the university also emphasizes innovation and entrepreneurship, with facilities like the Velocity incubator which supports startups.", "important_calendar": "https://uwaterloo.ca/important-dates/list", "statistics": "Undergraduate Programs: 100\nMaster's Programs: 48\nPhD Programs: 33", "faculty": "Applied Health Sciences, Faculty of\nArts, Faculty of\nEngineering, Faculty of\nEnvironment, Faculty of\nMathematics, Faculty of\nScience, Faculty of", "popular_programs": "Computer Science Program\nElectrical Engineering Program\nLife Sciences & Medicine Program", "others": "", "characteristics": "The University of Waterloo is recognized for its strong emphasis on innovation, entrepreneurship, and experiential learning. It is known for fostering a culture of curiosity, exploration, and risk-taking. Waterloo is also noted for its strategic integration of teaching and global stewardship, aiming to inspire innovations with a significant global impact. The university supports a vibrant ecosystem for entrepreneurs, evidenced by the success of numerous startups and the substantial funding raised by Waterloo entrepreneurs. Additionally, Waterloo is distinguished by its extensive co-operative education program, which was foundational to its establishment and continues to be a cornerstone of its educational approach, making it #1 in Canada for experiential learning and employer-student connections.", "programs": "Accounting and Financial Management\nActuarial Science\nAnthropology\nApplied Mathematics\nArchitectural Engineering\nArchitecture\nBiochemistry\nBiology\nBiomedical Sciences\nChemistry\nCivil Engineering\nComputer Engineering\nComputer Science\nData Science\nElectrical Engineering\nEnvironmental Engineering\nEnvironmental Studies\nGeography\nGeological Engineering\nGeoscience\nHistory\nKinesiology\nManagement Engineering\nMaterials and Nanosciences\nMathematical Economics\nMathematics\nMathematics/Business Administration\nMathematics/Financial Analysis and Risk Management\nMathematics/Teaching\nMechanical Engineering\nMechatronics Engineering\nMedicinal Chemistry\nNanotechnology Engineering\nOptometry\nPharmacy\nPhilosophy\nPhysics\nPhysics and Astronomy\nPlanning\nPolitical Science\nPsychology\nPublic Health\nRecreation and Leisure Studies\nReligious Studies\nScience and Aviation\nScience and Business\nSocial Development Studies\nSoftware Engineering\nSpanish\nStatistics\nSustainability and Financial Management\nSystems Design Engineering\nTeaching\nTheatre and Performance\nTherapeutic Recreation"}}
