{"University of Toronto": {"id_": "0", "university_name": "University of Toronto", "abbreviation": "U of T", "website": "https://www.utoronto.ca", "wikipedia": "The University of Toronto (U of T, UToronto, or Toronto) is a public research university in Toronto, Ontario, Canada, located on the grounds that surround Queen's Park. It was founded by royal charter in 1827 as King's College, the first institution of higher learning in the colony of Upper Canada. Known as the University of Toronto, its institutions develop enhancements in a diverse range of disciplines, influencing Canadian thought, culture, and society, as well as knowledge worldwide across many fields, including health care, scientific and artistic achievements.", "university_type": "public", "graduation_year": "4", "location": "The University of Toronto is located in Toronto, Ontario, Canada.", "graduation_rate": "The six-year graduation rate at the University of Toronto is approximately 85%.", "domestic_student_tuition": "$6,100 - $12,340", "international_student_tuition": "$43,620 - $62,580", "description": "The University of Toronto, located in Toronto, Ontario, Canada, is one of the world's leading institutions of higher learning. It was founded by royal charter in 1827 as King's College, the first institution of higher learning in the colony of Upper Canada. The university is known for influencing the historical School of Thought named 'Toronto School'. It consists of 11 colleges, each with substantial autonomy on financial and institutional affairs, and has various academic programs. The university is famous for significant contributions to fields such as insulin and stem cell research.", "ranking_qs_news_2024": "The University of Toronto is ranked 34th globally in the QS World University Rankings 2024.", "ranking_us_news_2023": "16", "ranking_times_rank_2024": "18", "ranking_arwu_rank_2024": "Data for the ARWU (Academic Ranking of World Universities) ranking of the University of Toronto for the year 2024 is not available as ARWU rankings are generally released in the current year and do not provide rankings for future years.", "important_calendar": "The University of Toronto's academic calendar typically includes key dates such as the start and end of classes, exam periods, holidays, and breaks. Each faculty may have slight variations in specific deadlines or additional noteworthy dates depending on the program.", "statistics": "The University of Toronto has a total student body of over 93,000 students including 71,000 undergraduates and 22,000 graduates across its three campuses. The University promotes research with an expenditure exceeding C$1.3 billion annually, making it one of the highest among Canadian universities.", "faculty": "The University of Toronto has 44,000 faculty and staff members, who are dedicated to advancing knowledge and fostering creativity. The faculty spans 17 schools and colleges, including a wide range of departments from the humanities and social sciences to science, medicine, and engineering. Noteworthy colleges include the Faculty of Arts and Science, the Faculty of Medicine, the Rotman School of Management, and the Faculty of Applied Science and Engineering.", "popular_programs": "The University of Toronto offers a wide range of popular programs including Computer Science, Engineering, Business, and Psychology.", "characteristics": "The University of Toronto (U of T) is known for its influential movements and notable contributions to higher education, including the collegiate system and being the birthplace of insulin and stem cell research. It ranks among the top public universities globally and is famous for its research-led teaching, diverse academic programs, and vibrant student life.", "others": "Other significant attributes of the University of Toronto include its strong emphasis on research, diverse academic programs, and active contributions to innovations in multiple fields such as medicine, engineering, and social sciences. Furthermore, U of T supports an array of extracurricular activities, including sports teams, arts and culture groups, and a vast number of student-led organizations. It also remains committed to fostering a diverse and inclusive environment."}}
{"University of Waterloo": {"id_": "0", "university_name": "University of Waterloo", "abbreviation": "UW", "website": "https://uwaterloo.ca", "wikipedia": "The University of Waterloo, located in Waterloo, Ontario, Canada, is renowned for its co-operative education (co-op) programs. It operates the largest post-secondary co-op program of its type in the world, which assists students to integrate academic studies with relevant work experiences. Founded in 1957, it offers a wide range of programs encompassing engineering, health, mathematics, science, arts, and environment. The University is also a member of the U15, a group of research-intensive universities in Canada.", "university_type": "public research university", "graduation_year": "4", "location": "The University of Waterloo is located in Waterloo, Ontario, Canada.", "graduation_rate": "The graduation rate at the University of Waterloo is approximately 89%.", "domestic_student_tuition": "$6,128 - $7,946", "international_student_tuition": "$37,038 - $51,448", "description": "The University of Waterloo, located in Waterloo, Ontario, Canada, is renowned for its cooperative education (co-op) programs that offer students unique opportunities to integrate academic studies with relevant work experiences. The university was established in 1957, and it has grown into a hub for innovation and a key player in the education and research sectors, particularly known for its programs in engineering, computer science, and health sciences.", "ranking_qs_news_2024": "166", "ranking_us_news_2023": "The University of Waterloo is ranked #166 in the 2023 Best Global Universities rankings by U.S. News & World Report.", "ranking_times_rank_2024": "201-250", "ranking_arwu_rank_2024": "The University of Waterloo does not have a projected ranking for ARWU in 2024, as future rankings are not typically pre-announced.", "important_calendar": "The University of Waterloo's key academic dates and deadlines for the study year can be found on their Important Dates Calendar. This includes dates for course enrolment, tuition fee deadlines, exam periods, and holiday schedules.", "statistics": "The University of Waterloo, located in Ontario, Canada, has a total student population of 42,620 for the 2020/2021 academic year. It includes 37,620 undergraduate and 5,000 postgraduate students.", "faculty": "The University of Waterloo has 6 faculties: Faculty of Arts, Faculty of Engineering, Faculty of Environment, Faculty of Health, Faculty of Mathematics, and Faculty of Science.", "popular_programs": ["Computer Science", "Software Engineering", "Mechanical Engineering", "Mathematics", "Accounting and Financial Management"], "characteristics": "The University of Waterloo is characterized by its strong focus on research, innovation, and cooperative education programs. It is known for its engineering, computer science, and mathematics programs. Waterloo operates the largest post-secondary co-op program in the world and is also home to three campuses in Canada.", "others": "attribute_prompt"}}
{"University of British Columbia": {"id_": "0", "university_name": "University of British Columbia", "abbreviation": "UBC", "website": "https://www.ubc.ca", "wikipedia": "https://en.wikipedia.org/wiki/University_of_British_Columbia", "university_type": "public research university", "graduation_year": "4", "location": "The University of British Columbia has two main campuses, the Vancouver campus and the Okanagan campus in Kelowna.", "graduation_rate": "The overall graduation rate at the University of British Columbia is approximately 83.5%.", "domestic_student_tuition": "N/A", "international_student_tuition": "N/A", "description": "The University of British Columbia (UBC), located in British Columbia, Canada, is a public university and a member of the U15 Group of Canadian Research Universities, the Association of Commonwealth Universities, the Association of Pacific Rim Universities, and Universitas 21. As of now, UBC has produced a total of 8 Nobel Prize laureates.", "ranking_qs_news_2024": "Not available yet", "ranking_us_news_2023": "34", "ranking_times_rank_2024": "37", "ranking_arwu_rank_2024": "The University of British Columbia is projected to be ranked within the top 40 globally according to the Academic Ranking of World Universities (ARWU) for the year 2024.", "important_calendar": "The academic calendar at UBC provides a comprehensive guide of important dates including the start and end of terms, statutory holidays, breaks, examination periods, as well as other key events. It usually outlines deadlines for the academic year, including the last days of enrollment and withdrawal from courses.", "statistics": "The University of British Columbia (UBC) has an enrollment of over 66,000 students, with approximately 16,188 international students from 156 countries. UBC has two main campuses, the Vancouver campus and the Okanagan campus.", "faculty": "The University of British Columbia is host to a large number of respected faculties including the Faculty of Arts, Science, Applied Science, Medicine, Sauder School of Business, Land and Food Systems, Forestry, Education, Law, and Pharmaceutical Sciences.", "popular_programs": ["Business Administration", "Psychology", "Biology", "Computer Science", "Economics"], "characteristics": "The University of British Columbia is characterized by its strong emphasis on research, sustainability, and diverse community. Notable for its innovative teaching and learning practices, as well as its leading contributions to society at large. The university consistently ranks among the top universities globally and embraces a global perspective while maintaining its commitment to local engagement.", "others": "attribute_prompt"}}
