{"Adler Graduate Professional School": {"id_": "1", "university_name": "Adler Graduate Professional School", "abbreviation": "AGPS", "website": "https://www.adler.ca", "wikipedia": "https://en.wikipedia.org/wiki/Adler_Graduate_Professional_School", "university_type": "private university", "graduation_year": "", "location": "Toronto, Ontario, Canada", "graduation_rate": "89", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $1,052 per credit hour", "ranking_qs_news_2024": "", "description": "Adler Graduate Professional School, located in Toronto, Ontario, Canada, focuses on training professionals in counselling psychology, psychotherapy, coaching, and leadership. The school emphasizes a holistic approach to mental health and well-being, integrating Adlerian principles into its programs.", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://www.adler.edu/wp-content/uploads/2024/01/Academic-Calendar_Online-Campus_2023_2024-010524.pdf", "statistics": "Undergraduate Programs: 0\nMaster's Programs: 8\nPhD Programs: 0", "faculty": "", "popular_programs": "Industrial and Organizational Psychology\\nCounselling Psychology\\nClinical Mental Health Counseling", "programs": "M.A. in Counseling: Specialization in Clinical Mental Health Counseling\nPh.D. in Counselor Education and Supervision\nMaster's in Organizational Leadership\nMaster of Arts in Counselling Psychology (MACP)\nPh.D. in Couple and Family Therapy", "characteristics": "Adler University is named for Alfred Adler, a pioneer in psychology, emphasizing community psychology and social justice. The university continues his legacy by focusing on graduating socially responsible practitioners. Programs like the Master of Applied Psychology and the M.A. in Counseling highlight this commitment by integrating applied research, community applications, and social justice into their curricula. Additionally, the Social Justice Practicum, a required internship, provides students with real-world experience aligned with civic-minded interests. The diverse student body at Adler University represents a wide range of professional interests, ethnic and cultural backgrounds, emphasizing the university's commitment to diversity and social responsibility.", "others": ""}}
{"Alberta Business School - University of Alberta": {"id_": "2", "university_name": "Alberta Business School - University of Alberta", "abbreviation": "U of A", "website": "https://www.ualberta.ca/business", "wikipedia": "https://en.wikipedia.org/wiki/University_of_Alberta_Faculty_of_Business", "university_type": "Public University", "graduation_year": "4", "location": "Edmonton, Alberta, Canada", "domestic_student_tuition": "CAD $5,320 - $5,320", "international_student_tuition": "CAD $5,284.08", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "graduation_rate": "85%", "description": "The Alberta School of Business at the University of Alberta offers a comprehensive range of programs including one of Canada's top MBA programs, with options for various specializations and combined degrees. Located at the 3-23 Business Building in Edmonton, Alberta, the school provides a dynamic educational environment with opportunities for professional growth, international experiences, and a strong alumni network spanning across the globe. The University of Alberta acknowledges that its campuses are situated on the traditional territories of many Indigenous peoples including the Cree, Blackfoot, Métis, Nakota Sioux, Iroquois, Dene, and Ojibway/Saulteaux.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://calendar.ualberta.ca/content.php?catoid=44&navoid=13726", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "faculty": "Alberta School of Business", "popular_programs": "Business Analytics\\nHuman Resource Management\\nMBA & Master's Programs\\nBachelor of Commerce Degree Programs", "programs": "Bachelor of Commerce (BCom)\nFull Time MBA\nExecutive MBA\nBusiness Analytics\nDoctor of Philosophy in Business (PhD) with specializations in Accounting, Finance, Operations and Information Systems, Marketing, and Strategy, Entrepreneurship and Management", "others": "", "characteristics": "The Alberta School of Business at the University of Alberta is recognized for its strong emphasis on research, ranking among the top 10 publicly-funded universities for research. The school is located in the heart of Edmonton, Alberta, and acknowledges its presence on the traditional territory of various Indigenous groups, including Cree, Blackfoot, Métis, Nakota Sioux, Iroquois, Dene, and Ojibway/Saulteaux. This acknowledgment reflects the university's respect for and recognition of the indigenous peoples and their traditional lands.\n\nThe school offers a variety of programs, including a highly regarded MBA program that provides flexibility to pursue various specializations and combined degrees. The leadership at the Alberta School of Business is marked by innovation and forward-thinking, with Dean Vikas Mehrotra taking the helm in 2023, emphasizing the school's commitment to maintaining its status as a leading institution in business education and research."}}
{"Algoma University": {"id_": "3", "university_name": "Algoma University", "abbreviation": "AU", "website": "https://www.algomau.ca", "wikipedia": "https://en.wikipedia.org/wiki/Algoma_University", "university_type": "Public University", "graduation_year": "4", "location": "Sault Ste. Marie, Ontario, Canada\nBrampton, Ontario, Canada\nTimmins, Ontario, Canada", "graduation_rate": "55%", "domestic_student_tuition": "CAD $6,128", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "description": "Algoma University, located in Sault Ste. Marie, Ontario, Canada, is a small undergraduate-only public university. Established in 1965, it was originally an affiliate of Laurentian University but became an independent institution in 2008. Algoma University is known for its personalized education, small class sizes, and a diverse student body. It offers a range of programs in liberal arts, sciences, and professional disciplines, with a particular focus on community development and cross-cultural learning. The university also emphasizes experiential learning and undergraduate research opportunities.", "ranking_arwu_rank_2023": "", "important_calendar": "https://algomau.ca/calendar/", "statistics": "Undergraduate Programs: 30\nMaster's Programs: 0\nPhD Programs: 0", "faculty": "Faculty of Sciences\nFaculty of Social Sciences\nFaculty of Humanities\nSchool of Business and Economics", "popular_programs": "Education Program\nSauder Business School\nEngineering Program", "programs": "Law and Justice\nMusic\nComputer Science\nBiology\nBusiness Administration\nMaster of Science in Biology\nMaster of Computer Science\nBachelor of Business\nPsychology", "others": "", "characteristics": "Algoma University is characterized by its commitment to providing a personalized and enriching academic experience. Here are some key highlights:\n\nSmall Class Sizes and Personal Attention: Algoma University emphasizes small seminars and hands-on labs, ensuring that students receive personal attention from faculty and staff who are invested in their goals.\n\nCross-Cultural Exchange: The university has a special mission focused on cross-cultural exchange, enriching the educational experience by celebrating diverse values, personalities, and convictions.\n\nActive Student Life: Outside the classroom, Algoma University offers a vibrant student life that supports personal success and wellbeing, aiming to provide an active university experience.\n\nLeadership and Innovation: With leaders like Asima Vezina and Michele Piercey-Normore, who bring extensive leadership and academic experience, Algoma University fosters an environment of innovation and transformational leadership.\n\nMultiple Campus Options: The university offers programs like the Master of Computer Science at both its Brampton and Sault Ste. Marie campuses, providing flexibility and choice for students."}}
{"Algonquin College": {"id_": "4", "university_name": "Algonquin College", "abbreviation": "AC", "website": "https://www.algonquincollege.com", "wikipedia": "https://en.wikipedia.org/wiki/Algonquin_College", "university_type": "public college", "graduation_year": "2-3", "graduation_rate": "0.89", "location": "Ottawa, Ontario, Canada\nPembroke, Ontario, Canada\nPerth, Ontario, Canada", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $16,200 - $22,000", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "description": "Algonquin College, officially known as Algonquin College of Applied Arts and Technology, is located in Ottawa, Ontario, Canada. It is a publicly funded English-language college and is one of the largest colleges in Canada with over 300 programs in fields such as business, health sciences, and technology. The college was established in 1967 and serves not only the Ottawa region but also has campuses in Pembroke and Perth. Algonquin College is known for its hands-on learning approach, integrating practical skills with classroom learning.", "ranking_arwu_rank_2023": "", "important_calendar": "https://www.algonquincollege.com/ro/academic-calendar/", "statistics": "Undergraduate Programs: 180\nMaster's Programs: 5\nPhD Programs: 0", "faculty": "Applied Arts and Technology\nBusiness\nCommunity Studies\nConstruction Trades and Building Systems\nHealth and Community Studies\nHospitality and Tourism\nMedia and Design\nPolice and Public Safety Institute\nTechnology and Trades", "popular_programs": "Bachelor of Culinary Arts and Food Science", "programs": "Therapeutic Recreation\nAutism and Behavioural Science\nAutism Studies\nBachelor of Business Administration (Trades Management) (Honours) - Pathway for Building Renovation Technology\nBachelor of Information Technology (Interactive Multimedia and Design)\nGeneral Arts and Science - English for Academic Purposes (EAP) (International)", "others": "", "characteristics": "Algonquin College is recognized for its practical and co-operative education approach, offering students real-world experience alongside their studies. Here are some key characteristics:\nPractical Learning and Co-op Programs: Algonquin College offers over 60 co-op programs, integrating classroom learning with practical, hands-on experience which is highly valued by employers.\nDiverse Program Offerings: The college provides a wide range of programs, including specialized courses like Therapeutic Recreation and Computer Engineering Technology, catering to various interests and career aspirations.\nCommitment to Internationalization: Despite challenges like COVID-19, Algonquin College prioritizes international enrollment, aiming to foster a global learning environment.\nHistorical Roots and Growth: Originating from the merger of the Eastern Ontario Institute of Technology and the Ontario Vocational Centre, Algonquin College has a long history and continues to expand its educational influence.\nStrategic Industry Partnerships: The college actively engages in strategic partnerships, such as the Memorandum of Understanding with CAE, to advance workforce development, skills training, and innovation across multiple sectors."}}
{"Asper School of Business - University of Manitoba": {"id_": "5", "university_name": "Asper School of Business - University of Manitoba", "abbreviation": "UM", "website": "https://umanitoba.ca/asper", "wikipedia": "https://en.wikipedia.org/wiki/Asper_School_of_Business", "university_type": "Public University", "graduation_year": "4", "location": "Winnipeg, Manitoba, Canada", "graduation_rate": "89", "domestic_student_tuition": "CAD $5,700", "international_student_tuition": "CAD $736.37 per credit hour", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "description": "The Asper School of Business at the University of Manitoba, located in Winnipeg, Manitoba, Canada, is a prominent business school known for its rigorous academic programs and strong ties to the business community. It offers a range of undergraduate, graduate, and professional programs, including a Bachelor of Commerce (Honours) degree and an MBA program. The school emphasizes experiential learning, entrepreneurship, and research, aiming to develop innovative leaders and contribute significantly to the business world. Asper is also recognized for its commitment to diversity and inclusion in business education.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://umanitoba.ca/asper/important-dates", "statistics": "Undergraduate Programs: 3\nMaster's Programs: 1\nPhD Programs: 2", "faculty": "Ivey Business School", "popular_programs": "Actuarial Program\\nMaster of Finance (MFin)\\nBachelor of Commerce (Honours)\\nMBA Program", "programs": "Bachelor of Commerce (Honours) - Accounting\nBachelor of Commerce (Honours) - Actuarial Mathematics\nBachelor of Commerce (Honours) - Entrepreneurship/Small Business\nBachelor of Commerce (Honours) - Finance\nBachelor of Commerce (Honours) - Generalist\nBachelor of Commerce (Honours) - Human Resource Management/Industrial Relations\nBachelor of Commerce (Honours) - International Business\nBachelor of Commerce (Honours) - Leadership and Organizations\nBachelor of Commerce (Honours) - Logistics and Supply Chain Management\nBachelor of Commerce (Honours) - Management Information Systems\nBachelor of Commerce (Honours) - Marketing\nMaster of Business Administration\nMaster of Finance\nMaster of Supply Chain Management and Logistics\nPh.D. in Management", "others": "", "characteristics": "The Asper School of Business at the University of Manitoba is characterized by its strong commitment to research, teaching excellence, and community engagement. Here are some key characteristics:\n\nResearch and Academic Excellence: The school has evolved from a small department established in 1937 to a major research and teaching unit. It boasts over 60 full-time staff and approximately 1800 students across bachelor's, master's, and doctorate levels, emphasizing its significant role in influencing business and leadership locally and globally.\n\nDedicated Faculty: The faculty at Asper are globally renowned, contributing diverse international perspectives to the learning experience, which enriches the educational environment and prepares students for global business challenges.\n\nExperiential Learning and Student Support: The Asper School of Business offers practical learning opportunities such as the Price Student‐Managed Investment Fund, which enhances experiential learning and supports student success. Additionally, the school maintains strong relationships with The Associates, a group dedicated to advancing business education at Asper for over 40 years.\n\nInclusiveness and Integrity: The leadership at Asper is committed to maintaining a culture of excellence, inclusiveness, integrity, and community engagement, ensuring a supportive and ethical environment for both students and staff."}}
{"Assiniboine Community College": {"id_": "6", "university_name": "Assiniboine Community College", "abbreviation": "ACC", "website": "https://assiniboine.net", "wikipedia": "https://en.wikipedia.org/wiki/Assiniboine_Community_College", "university_type": "public college", "graduation_year": "2", "location": "Brandon, Manitoba, Canada\nDauphin, Manitoba, Canada\nWinnipeg, Manitoba, Canada", "graduation_rate": "89", "domestic_student_tuition": "CAD $3.70 - $32.14", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "description": "Assiniboine Community College, located in Manitoba, Canada, offers a variety of programs including diplomas, certificates, and apprenticeships in fields such as business, agriculture, health, and technology. The college is known for its practical, hands-on learning experiences designed to prepare students for the workforce. It has multiple campuses, with the main campus situated in Brandon. Assiniboine Community College serves a diverse student body and aims to contribute to the economic and social vitality of the region.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://assiniboine.net/admissions/registrars-office/important-dates", "statistics": "Undergraduate Programs: 40\nMaster's Programs: 0\nPhD Programs: 0", "faculty": "Business\nAgriculture & Environment", "popular_programs": "marketing\\naccounting\\nfinance\\nagribusiness\\nbusiness administration", "programs": "Practical Nursing\nCulinary Arts", "characteristics": "Assiniboine Community College is recognized as a Designated Learning Institution by both the Province of Manitoba and the Government of Canada. It offers a variety of programs with multiple start dates throughout the year, including fall, winter, and spring, allowing students flexibility in beginning their education. The college also has a strong commitment to reconciliation and aims to reduce educational and employment gaps between Indigenous and non-Indigenous peoples. Additionally, Assiniboine supports a vibrant varsity sports program and has achieved notable success in national competitions like Skills Canada.", "others": ""}}
{"Athabasca University": {"id_": "7", "university_name": "Athabasca University", "abbreviation": "AU", "website": "https://www.athabascau.ca", "wikipedia": "https://en.wikipedia.org/wiki/Athabasca_University", "university_type": "Public University", "graduation_year": "4", "location": "Athabasca, Alberta, Canada\nEdmonton, Alberta, Canada\nCalgary, Alberta, Canada\nSt. Albert, Alberta, Canada", "graduation_rate": "0.89", "domestic_student_tuition": "CAD $7,500 / CAD $7,500 - $7,500", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "description": "Athabasca University, based in Alberta, Canada, is a public university primarily known for its online and distance education programs. It was established in 1970 with the aim of removing barriers to higher education and making learning accessible to a wider population. Athabasca University offers a range of undergraduate and graduate programs and is recognized for its flexibility, allowing students to start courses at any time and work at their own pace. It is a part of the Canadian Virtual University consortium, which emphasizes online learning.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://www.athabascau.ca/calendar/undergraduate/general-information/important-dates.html", "statistics": "Undergraduate Programs: 99\nMaster's Programs: 45\nPhD Programs: 5", "faculty": "Faculty of Science and Technology\nFaculty of Humanities and Social Sciences\nFaculty of Graduate Studies", "popular_programs": "Master of Science in Information Systems (MScIS)\nMaster of Arts - Interdisciplinary Studies\nMaster of Business Administration\nBachelor of Commerce, Human Resources Management\nBachelor of Management", "programs": "Master of Counselling\nDoctor of Business Administration\nMaster of Arts - Interdisciplinary Studies\nMaster of Science in Information Systems\nGraduate Diploma in Counselling\nMaster of Business Administration\nGraduate Diploma in Management", "others": "", "characteristics": "Athabasca University (AU) is recognized for its distinctive approach to online and distance education. Here are some key characteristics:\n\nOpen and Flexible Learning: AU is known as Canada's Open University, emphasizing its commitment to providing accessible education to anyone over the age of 16, regardless of their previous academic history. This open admission policy makes higher education more accessible to a broader audience.\n\nFully Online Digital Platform: AU stands out as the only public university in Canada that is entirely digital by design, offering all its courses and programs online. This approach allows students from across Canada and around the world to pursue their studies remotely.\n\nWide Range of Programs: AU offers a diverse array of undergraduate and graduate programs across various fields including business, health, technology, science, and humanities. This variety ensures that students can find courses that match their career goals and interests.\n\nContinuous Enrollment: Unlike traditional universities, AU allows students to enroll at any time and start their courses immediately, providing flexibility in terms of pacing and scheduling. This feature is particularly beneficial for students who need to balance their studies with other commitments like work or family.\n\nCommitment to Research and Academic Excellence: AU actively supports scholarly activities that enhance student learning and contribute to the academic community. The university annually recognizes achievements in teaching, leadership, and research through its Academic Excellence Awards."}}
{"Beedie School of Business - Simon Fraser University": {"id_": "8", "university_name": "Beedie School of Business - Simon Fraser University", "abbreviation": "SFU Beedie", "website": "https://beedie.sfu.ca/", "wikipedia": "https://en.wikipedia.org/wiki/Beedie_School_of_Business", "university_type": "Public University", "graduation_year": "16", "location": "Burnaby, British Columbia, Canada\nVancouver, British Columbia, Canada\nSurrey, British Columbia, Canada", "graduation_rate": "89", "domestic_student_tuition": "CAD $1,066.44", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "description": "The Beedie School of Business at Simon Fraser University, located in Metro Vancouver, British Columbia, is recognized as one of Canada's leading business schools. It offers a range of undergraduate and graduate programs, including the notable Bachelor of Business Administration (BBA) and the Executive MBA, the first of its kind in Canada established in 1968. The school is known for its strong emphasis on real-world class projects and experience-based learning opportunities. It holds prestigious accreditations from AACSB and EQUIS, underscoring its commitment to high-quality business education. The faculty collaborates closely with business and community partners, fostering a dynamic teaching and learning environment that is geared towards producing research that impacts the global knowledge economy.", "ranking_arwu_rank_2023": "", "important_calendar": "https://beedie.sfu.ca/programs/undergraduate/academic-calendar", "statistics": "Undergraduate Programs: 20\nMaster's Programs: 8\nPhD Programs: 1", "faculty": "Beedie School of Business", "popular_programs": "MSc Finance\nMBA and graduate programs\nPhD program", "programs": "Bachelor of Business Administration (BBA)  \nMaster of Business Administration (MBA)  \nGraduate Certificate in Accounting with Digital Analytics  \nMSc Finance  \nInternational Programs  \nBusiness Foundation Program  \nCo-op Programs", "others": "", "characteristics": "Beedie School of Business at Simon Fraser University is recognized for its strong academic research, ranking among the top 100 business schools globally. The school emphasizes real-world application through class projects and experience-based opportunities, offering programs like the Bachelor of Business Administration and options for non-business students to pursue a Business Minor.\n\nThe school has a history of innovation, being the first in Canada to launch an Executive MBA program. It fosters collaboration between faculty, researchers, and business and community partners, maintaining high standards with accreditations from AACSB and recognition with an EQUIS Quality award from EFMD.\n\nLocated in Metro Vancouver, British Columbia, Beedie is positioned in a dynamic region, enhancing its appeal and relevance in the global business landscape. The school is committed to developing individuals, organizations, and communities, aiming to make a significant impact on the business world."}}
{"Bishop's University": {"id_": "9", "university_name": "Bishop's University", "abbreviation": "BU", "website": "https://www.ubishops.ca", "wikipedia": "https://en.wikipedia.org/wiki/Bishop%27s_University", "university_type": "Public University", "graduation_year": "4", "location": "Sherbrooke, Quebec, Canada", "graduation_rate": "89", "domestic_student_tuition": "CAD $4,752.83 / CAD $4,752.83 - $4,752.83", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "description": "Bishop's University is a small, English-language liberal arts university located in Lennoxville, a borough of Sherbrooke, Quebec, Canada. It was founded by the Anglican Bishop of Quebec, George Mountain, who also served as the first principal of McGill University. Bishop's University is one of the three universities in Quebec that primarily teach in English. It offers a close-knit educational environment with a student body of around 2,400 full-time students as of 2019, 30% of whom come from outside Quebec. The university is known for its small size and is one of the oldest universities in Canada.", "ranking_arwu_rank_2023": "", "important_calendar": "https://www.ubishops.ca/academic-programs/academic-calendar/sessional-dates/", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "faculty": "Williams School of Business\nFaculty of Arts and Science\nSchool of Education", "popular_programs": "Business", "characteristics": "Bishop's University is a small liberal arts college located in Sherbrooke, Quebec, known for its intimate campus environment and strong sense of community. Here are some key characteristics:\n\nPersonalized Education: Bishop's University prides itself on its small class sizes and close interactions between students and faculty, which foster a personalized learning experience.\n\nLiberal Arts Focus: The university emphasizes a liberal arts education, encouraging students to explore a broad range of disciplines and develop critical thinking and communication skills.\n\nVibrant Campus Life: Bishop's is renowned for its vibrant campus life, with numerous clubs, societies, and sports teams, providing students with a well-rounded educational experience.\n\nHistoric Setting: The university boasts a picturesque campus with historic architecture, nestled in the scenic Eastern Townships of Quebec.", "others": "", "programs": "School of Business:\n- Bachelor of Business Administration\n- Bachelor of Arts in Business\n- Bachelor of Science in Business\n\nSchool of Education:\n- Bachelor of Education\n- Bachelor of Arts in Educational Studies\n\nSchool of Humanities:\n- Bachelor of Arts in English\n- Bachelor of Arts in History\n- Bachelor of Arts in Philosophy\n- Bachelor of Arts in Religion\n- Bachelor of Arts in Classical Studies\n- Bachelor of Arts in Modern Languages\n- Bachelor of Arts in Fine Arts\n- Bachelor of Arts in Drama\n- Bachelor of Arts in Music\n\nSchool of Natural Sciences and Mathematics:\n- Bachelor of Science in Biology\n- Bachelor of Science in Chemistry\n- Bachelor of Science in Physics\n- Bachelor of Science in Mathematics\n- Bachelor of Science in Computer Science\n- Bachelor of Science in Environmental Science and Geography\n\nSchool of Social Sciences:\n- Bachelor of Arts in Psychology\n- Bachelor of Arts in Sociology\n- Bachelor of Arts in Political Studies\n- Bachelor of Arts in Economics\n- Bachelor of Arts in International Studies\n- Bachelor of Arts in Criminology and Criminal Justice\n\nWilliams School of Business:\n- Bachelor of Business Administration\n- Bachelor of Arts in Business\n- Bachelor of Science in Business"}}
{"Bow Valley College": {"id_": "10", "university_name": "Bow Valley College", "abbreviation": "BVC", "website": "https://bowvalleycollege.ca", "wikipedia": "https://en.wikipedia.org/wiki/Bow_Valley_College", "university_type": "public college", "graduation_year": "2", "location": "Calgary, Alberta, Canada\nAirdrie, Alberta, Canada\nBanff, Alberta, Canada\nCochrane, Alberta, Canada\nHigh River, Alberta, Canada\nOkotoks, Alberta, Canada\nStrathmore, Alberta, Canada", "graduation_rate": "94%", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "description": "Bow Valley College, located in Calgary, Alberta, Canada, is a public community college specializing in delivering quality, adult education training and programs for over 50 years. It offers a variety of career programs in areas such as business, health care, and technology. The college serves over 15,000 learners each year through its main campus in downtown Calgary and regional campuses serving surrounding areas.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://bowvalleycollege.ca/student-resources/academic-services/important-dates", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "faculty": "School of Community Programs\nAcademic Upgrading Programs\nSchool of Technology\nSchool of Community Studies", "popular_programs": "cybersecurity\ninformation technology services\nbusiness\nhealth care", "programs": "Digital Design Diploma\nCertificates\nDiplomas\nPost-Diploma Certificates\nAdult Upgrading\nEnglish Language Learning\nMedical Office Assistant and Unit Clerk Certificate\nInterdisciplinary Therapy Assistant Diploma\nPractical Nurse Diploma\nPharmacy Technician Diploma\nRecreation Therapy Aide Certificate\nOpen Studies Courses\nMicro-credential Programs in Digital Design", "others": "", "characteristics": "Bow Valley College is a Canadian public, board-governed college located in Calgary, Alberta, operating as a comprehensive community institution under the Post-Secondary Learning Act of Alberta. It is Calgary and region's only Comprehensive Community College with 14,000 full- and part-time students. Bow Valley College offers academic and career education in various communities and on a number of the region's Indigenous nations. It is known for its certificate, diploma, post-diploma, and post-baccalaureate degrees in 5 main study areas. The college is also ranked among the top 50 research colleges in Canada."}}
{"Brandon University": {"id_": "11", "university_name": "Brandon University", "abbreviation": "BU", "website": "https://www.brandonu.ca", "wikipedia": "https://en.wikipedia.org/wiki/Brandon_University", "university_type": "Public University", "graduation_year": "4", "location": "Brandon, Manitoba, Canada", "graduation_rate": "89", "domestic_student_tuition": "CAD $667.88 / CAD $642.81 - $692.95", "international_student_tuition": "CAD $1,434.12 - $1,487.40", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "description": "Brandon University, located in Brandon, Manitoba, Canada, is a public university known for its liberal arts and sciences programs. The university offers undergraduate degrees in arts, education, music, and health studies, as well as graduate programs in music, psychiatric nursing, and rural development. Brandon University is recognized for its small class sizes and personalized learning experiences, providing a supportive academic environment.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://www.brandonu.ca/registration/important-dates/", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "faculty": "Arts, Faculty of\nScience, Faculty of\nEducation, Faculty of", "popular_programs": "Education Program\nMusic Program\nScience Program", "programs": "Arts\\nEducation\\nMusic\\nHealth Studies\\nScience\\nAfter Degree B.A./B.Ed. program\\nMaster of Science (Environmental and Life Sciences)", "others": "", "characteristics": "Brandon University is characterized by its commitment to inclusivity, accessibility, and support tailored to meet the unique needs of its region and students. The university fosters an inclusive, collegial, student-centered culture, engaging a diverse population in scholarly activities, research, and active citizenship. It emphasizes community engagement and mentorship, particularly through its Faculty of Education, which aims to mentor educators to thrive as caring and engaged innovators in diverse communities. Additionally, Brandon University is proactive in enhancing its academic offerings and campus facilities, as evidenced by hosting significant events like international conferences and improving student facilities like the secure cycle compound."}}
{"British Columbia Institute of Technology": {"id_": "12", "university_name": "British Columbia Institute of Technology", "abbreviation": "BCIT", "website": "https://www.bcit.ca", "wikipedia": "https://en.wikipedia.org/wiki/British_Columbia_Institute_of_Technology", "university_type": "public college", "graduation_year": "2-4", "location": "Burnaby, British Columbia, Canada\nVancouver, British Columbia, Canada\nRichmond, British Columbia, Canada\nNorth Vancouver, British Columbia, Canada", "graduation_rate": "0.89", "domestic_student_tuition": "CAD $6,000 - $18,000", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "description": "The British Columbia Institute of Technology (BCIT), located in Burnaby, British Columbia, Canada, is a public post-secondary institution offering specialized technical education and skills training in fields such as applied and natural sciences, business, engineering, and health sciences. BCIT provides practical career credentials designed for the labor market, including degrees, diplomas, and certificates, and serves approximately 48,000 students through full-time, part-time, and distance & online learning programs. BCIT emphasizes technology-infused learning and collaboration with industry partners to ensure that its graduates are ready to meet the demands of employers in various sectors.", "ranking_arwu_rank_2023": "", "important_calendar": "https://www.bcit.ca/academic-dates/", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "faculty": "Business + Media\nHealth Sciences\nArchitectural Science\nComputing\nMechatronics and Robotics\nTrades and Technology", "popular_programs": "Education Program\nSauder Business School\nEngineering Program", "programs": "Accounting, Finance and Insurance\nAdministrative and Office\nApplied and Natural Sciences\nArchitecture and Building\nBusiness and Media\nCivil Engineering\nComputing and IT\nConstruction and Trades\nEducation and Social Services\nElectrical and Electronics\nEnergy\nEngineering\nForestry\nHealth Sciences\nHospitality and Tourism\nHuman Resources\nManufacturing\nMarine\nMarketing and Sales\nMechanical Engineering\nMining and Mineral Exploration\nOperations and Project Management\nTransportation", "others": "", "characteristics": "BCIT is known for its practical, flexible, applied education with instructors who have direct, hands-on experience in their field. This educational approach is distinct from traditional colleges and universities, focusing more on practical skills and industry readiness. BCIT has been influential in shaping the economy by educating professionals and innovators who contribute significantly across various sectors. The institute also features a state-of-the-art Aerospace Technology Campus, which includes a fleet of 20 aircraft and advanced simulation technologies, highlighting its commitment to providing cutting-edge educational facilities. Additionally, BCIT has been recognized repeatedly as one of BC's Top Employers, underscoring its role as a leading institution not only in education but also as a workplace."}}
{"Brock University": {"id_": "13", "university_name": "Brock University", "abbreviation": "BU", "website": "https://brocku.ca", "wikipedia": "https://en.wikipedia.org/wiki/Brock_University", "university_type": "Public University", "graduation_year": "4", "location": "St. Catharines, Ontario, Canada\nHamilton, Ontario, Canada", "graduation_rate": "0.89", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "1201-1400", "ranking_us_news_2023": "", "description": "Brock University, located in St. Catharines, Ontario, Canada, is a public research university established in 1964. Named after Major-General Sir Isaac Brock, a hero of the War of 1812, the university is known for its strong programs in various fields including business, health sciences, humanities, and wine science. Brock offers a range of undergraduate, graduate, and doctoral programs and is recognized for its experiential learning opportunities and vibrant campus life. The university also emphasizes research, hosting several research centers and institutes that contribute to its reputation as a hub for academic and professional development.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://brocku.ca/important-dates/", "statistics": "Undergraduate Programs: 49\nMaster's Programs: 50\nPhD Programs: 6", "faculty": "Goodman School of Business\r\nFaculty of Applied Health Sciences\r\nFaculty of Education\r\nFaculty of Humanities\r\nFaculty of Mathematics and Science\r\nFaculty of Social Sciences", "popular_programs": "Education Program\nBusiness Program", "programs": "BSc in Computer Science\nBAcc program\nBusiness Administration Co-op\nMaster of Science in Management (MSc)\nBachelor of Business Administration (BBA)", "others": "", "characteristics": "Brock University is one of Canada's top post-secondary institutions, offering a blend of modern university benefits in a safe, community-minded city surrounded by natural beauty. Located in the historic Niagara region, it provides a comprehensive educational experience with rich academic programs and world-class research activity. Brock is situated in a UNESCO Biosphere Reserve, emphasizing its commitment to sustainability and respect for the environment. The university has a vibrant student population of over 19,000, fostering a close-knit community atmosphere despite its size. With nearly 600 full-time faculty members, Brock offers more than 70 undergraduate and graduate programs, contributing to its reputation as a transformative institution that changes lives through education and research."}}
{"Cambrian College": {"id_": "14", "university_name": "Cambrian College", "abbreviation": "CC", "website": "https://www.cambriancollege.ca", "wikipedia": "https://en.wikipedia.org/wiki/Cambrian_College", "university_type": "public college", "graduation_year": "1", "location": "Sudbury, Ontario, Canada\nBarrydowne, Ontario, Canada", "graduation_rate": "89", "domestic_student_tuition": "CAD $367.22", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "description": "Cambrian College, located in Sudbury, Ontario, Canada, is a public college of applied arts and technology. Established in 1967, it is one of the largest colleges in northern Ontario and offers over 80 full-time programs across various fields such as business, health sciences, and trades. Cambrian College is known for its vibrant campus life, practical learning experiences, and strong focus on student success.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://cambriancollege.ca/admissions/academic-planning/academic-schedule", "statistics": "Undergraduate Programs: 80\nMaster's Programs: 0\nPhD Programs: 0", "faculty": "School of Business\nSchool of Creative Arts, Design and Music\nSchool of Health Sciences\nSchool of Justice, Community Services and General Studies\nSchool of Skills Training\nSchool of Environmental and Natural Resource Sciences\nSchool of Engineering Technology and Information Technology", "popular_programs": "Business Analytics\\nHealth Science and Nursing\\nEngineering\\nBusiness\\nLaw and Justice Community Service\\nCreative Arts and Design", "programs": "Practical Nursing\nBusiness\nProject Management\nHonours Bachelor of Science in Nursing", "others": "", "characteristics": "Cambrian College is located in Sudbury, Ontario, and offers a vibrant campus life surrounded by the natural beauty of the region, which includes 300 area lakes and opportunities for various seasonal outdoor activities. The college emphasizes a supportive and inclusive environment, aiming to foster student success through a range of programs and services. Cambrian College is committed to diversity and inclusion, making it a welcoming place for students of all identities and experiences. The college also engages with the community and maintains strong partnerships, enhancing both educational and professional opportunities for students."}}
{"Cambrian College (Hanson Campus)": {"id_": "15", "university_name": "Cambrian College (Hanson Campus)", "abbreviation": "CC", "website": "https://www.cambriancollege.ca/campuses/hanson-campus/", "wikipedia": "https://en.wikipedia.org/wiki/Cambrian_College", "university_type": "public college", "graduation_year": "2", "location": "Sudbury, Ontario, Canada\nToronto, Ontario, Canada\nBrampton, Ontario, Canada", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $37,038 - $51,448", "graduation_rate": "89", "ranking_qs_news_2024": "", "description": "Cambrian College's Hanson Campus in Toronto, Ontario, is a collaboration between Hanson Canada and Cambrian College of Applied Arts and Technology. It offers high-quality education primarily to international students, focusing on programs that provide pathways to employment, further education, and opportunities to transition to permanent residency in Canada.", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://cms.cambriancollege.ca/wp-content/uploads/2024/03/2024-2025-Academic-Schedule-B-14-week-blocks-Nov-Mar-Jul.pdf", "faculty": "Business\nCommunity Services\nCreative Arts, Music, and Design\nEngineering Technology\nHealth Sciences\nJustice, Community Services, and General Studies\nMining and Skilled Trades\nEnvironmental Studies\nHospitality\nInformation Technology", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "popular_programs": "Business Program\nI.T. Program\nElectromechanical Engineering Technology - Mechatronics Program\nGlobal Business Management\nHuman Resources Management", "programs": "Electromechanical Engineering Technology - Mechatronics\\nMobile Application Development\\nPractical Nursing\\nInternational Business Management", "characteristics": "Cambrian College, the largest college in northeastern Ontario, serves a diverse student body with over 5,000 full-time and part-time students from approximately 70 countries. The college offers a wide range of programs including degrees, post-graduate certificates, diplomas, advanced diplomas, certificates, and microcredentials.", "others": ""}}
{"Camosun College": {"id_": "16", "university_name": "Camosun College", "abbreviation": "CC", "website": "https://camosun.ca", "wikipedia": "https://en.wikipedia.org/wiki/Camosun_College", "university_type": "public college", "graduation_year": "2", "location": "Victoria, British Columbia, Canada\nVictoria, British Columbia, Canada", "graduation_rate": "89%", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $6,271", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "description": "Camosun College, located in Victoria, British Columbia, Canada, is a public community college serving approximately 19,000 students. Founded in 1971, the college offers over 160 programs across two campuses, Lansdowne and Interurban. Camosun College provides a range of programs including university transfer courses, degree and applied degree programs, diplomas, certificates, and upgrading courses. It is known for its focus on practical learning experiences and strong connections with industry to ensure that students are ready for employment upon graduation.", "important_calendar": "https://calendar.camosun.ca/content.php?catoid=24&navoid=2189", "statistics": "", "faculty": "Arts and Science, Faculty of\r\nBusiness, School of\r\nHealth and Human Services, School of\r\nTrades and Technology, School of", "popular_programs": "Carpentry Apprenticeships\nBusiness\nEngineering\nTechnology\nHospitality & Tourism\nHumanities\nSport & Exercise Management\nHealth and Human Services\nIndigenous Education\nTrades\nSports and Exercise Education\nSciences\nNursing (Baccalaureate of Science)", "programs": "Applied Chemistry and Biotechnology, Diploma\nApplied Tourism & Hospitality Management, Post Degree Diploma\nArchaeological Field Assistant, Certificate\nArts and Science Studies, Diploma\nAthletic & Exercise Therapy, Bachelor's Degree\nAutomotive Service Technician Foundation, Certificate\nBasic English as a Second Language, Certificate", "others": "", "characteristics": "Camosun College is recognized for its commitment to diversity and inclusion, particularly in supporting underrepresented groups such as women and Indigenous peoples in the technology sector. The college has received additional funding from the B.C. government to launch programs aimed at these groups, highlighting its proactive approach to social equity and education.\n\nCamosun College also excels in athletics, with student-athletes competing provincially and nationally in sports like volleyball and basketball. This involvement in competitive sports underscores the college's dedication to fostering physical education and team spirit among its students.\n\nAcademically, Camosun offers a wide range of over 160 innovative programs that cater to various interests and career paths, from trades to technology and beyond. This variety ensures that students have ample opportunities to pursue their educational and professional goals in a supportive environment.\n\nThe college's focus on applied learning and small class sizes provides a personalized and effective educational experience, making it a top choice for students seeking practical and hands-on learning experiences in British Columbia.\n\nLastly, Camosun College is situated in a unique geographical location that respects and acknowledges the local indigenous cultures, further enriching the educational experience by fostering a connection with the community and its history."}}
{"Canada College/Collège Canada": {"id_": "17", "university_name": "Canada College/Collège Canada", "abbreviation": "CC", "website": "https://www.canadacollege.com", "wikipedia": "https://en.wikipedia.org/wiki/Canada_College", "university_type": "Public College", "graduation_year": "2", "location": "Redwood City, California, United States", "graduation_rate": "35%", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "description": "Canada College, also known as Collège Canada, is a private college located in Montreal, Quebec, Canada. It offers a variety of programs in fields such as Business, Technology, and Health Sciences, catering to both local and international students. The college is known for its practical and career-oriented approach to education, aiming to prepare students effectively for the workforce.", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://calendar.ubc.ca/", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "faculty": "Applied Science, Faculty of\nArchitecture and Landscape Architecture, School of\nArts, Faculty of\nAudiology and Speech Sciences, School of\nBusiness, Sauder School of\nCommunity and Regional Planning, School of\nDentistry, Faculty of\nEducation, Faculty of\nExtended Learning\nForestry, Faculty of\nGraduate and Postdoctoral Studies\nJournalism, School of\nKinesiology, School of\nLand and Food Systems, Faculty of\nLaw, Peter A. Allard School of\nLibrary, Archival and Information Studies, School of\nMedicine, Faculty of\nMusic, School of\nNursing, School of\nPharmaceutical Sciences, Faculty of\nPopulation and Public Health, School of\nPublic Policy and Global Affairs, School of\nScience, Faculty of\nSocial Work, School of\nUBC Vantage College\nVancouver School of Economics", "popular_programs": "Education Program\nSauder Business School\nEngineering Program", "programs": "", "others": "", "characteristics": "Cañada College is a community college located in Redwood City, California, strategically positioned between San Francisco and San Jose in the heart of Silicon Valley. This location offers students access to a vibrant urban environment and a high-tech industry hub. The college provides a wide range of associate degree programs that facilitate student transfers to four-year universities, including those within the University of California and California State University systems.\n\nThe college is committed to supporting a diverse student body with various programs such as Puente, Promise, and the Associated Students of Cañada College. It also offers resources like the Disability Resource Center and honors societies like Phi Theta Kappa. These programs and resources are designed to enhance student success and prepare them for further academic pursuits.\n\nCañada College also emphasizes comprehensive educational opportunities with offerings in more than 40 quality instructional programs across multiple disciplines including sciences, business, multimedia, medical assisting, the arts, and technical training. Additionally, the college is involved in continuous improvement of its physical, technological, and transportation infrastructure to support equitable access and educational outcomes for its community."}}
{"Canadore College": {"id_": "18", "university_name": "Canadore College", "abbreviation": "Canadore", "website": "https://www.canadorecollege.ca", "wikipedia": "https://en.wikipedia.org/wiki/Canadore_College", "university_type": "public college", "graduation_year": "2-3", "location": "North Bay, Ontario, Canada\nParry Sound, Ontario, Canada", "graduation_rate": "68%", "domestic_student_tuition": "Attribute: domestic_student_tuition\nOutput: CAD $13,829 / CAD $6,354 - $19,303.5", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "description": "Canadore College is a public college located in North Bay, Ontario, Canada, primarily serving international students. It was established in 1967 as a campus of Cambrian College in Sudbury and became an independent institution in 1972. The college has three campuses in North Bay and one in Parry Sound, Ontario. Canadore College is known as a College of Applied Arts and Technology and offers a variety of programs in fields such as technology, business, and health sciences.", "important_calendar": "https://www.canadorecollege.ca/experience/calendar", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "faculty": "Civil Engineering\nMechanical Engineering\nMotive Power Technician\nCarpentry\nMachinist\nWelding\nElectrical Programs", "popular_programs": "Education Program\nSauder Business School\nEngineering Program", "programs": "Honours Bachelor of Science - Nursing\nGeneral Arts and Science\nGame Design and Development\nProject Management - Information Technology\nProject Management\nPractical Nursing\nHealth Care Administration", "others": "", "characteristics": "Canadore College is recognized for its commitment to student success, community connection, and sustainability. Here are some key characteristics:\n\nStudent-Centered Learning: Canadore College prioritizes creating an optimal environment for learning, focusing on student success and program excellence.\n\nCommunity Engagement: The college maintains strong connections to the community, ensuring that its programs and initiatives are aligned with local needs and opportunities.\n\nSustainability Goals: Canadore aims to become carbon neutral by 2031 and integrates Sustainable Development Goals (SDGs) into its core operations, promoting well-being and environmental responsibility.\n\nInnovative Research: Students at Canadore College engage in applied research, gaining practical skills in fields like healthcare, the environment, and genomics, which enhances their learning and career readiness.\n\nEntrepreneurial Spirit: Despite receiving less than half of its funding from traditional sources, Canadore College thrives by fostering innovation and relying on entrepreneurial endeavors and the support of donors."}}
{"Cape Breton University": {"id_": "19", "university_name": "Cape Breton University", "abbreviation": "CBU", "website": "https://www.cbu.ca", "wikipedia": "https://en.wikipedia.org/wiki/Cape_Breton_University", "university_type": "Public University", "graduation_year": "4", "location": "Sydney, Nova Scotia, Canada", "graduation_rate": "89%", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $37,038 - $51,448", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "description": "Cape Breton University (CBU), located in Sydney, Nova Scotia, Canada, is a public university primarily known for its strong community involvement and commitment to cultural diversity. It offers a range of undergraduate and graduate programs, focusing on liberal arts, science, business, and health studies. CBU is particularly noted for its support of Aboriginal and international students, providing a unique and inclusive educational environment.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://www.cbu.ca/academic-calendar/", "statistics": "Undergraduate Programs: 99\nMaster's and PhD Programs: 84", "faculty": "Shannon School of Business\nSchool of Science and Technology", "popular_programs": "Engineering Program\nCommunication Program\nEnvironmental Studies Program", "programs": "Mi'kmaq Studies Program  \nBachelor of Science, Nursing  \nBachelor of Science  \nBachelor of Education (B.Ed.)  \nBachelor of Arts (BA)  \nBachelor of Health Sciences (Public Health)", "others": "", "characteristics": "Cape Breton University (CBU) is characterized by its strong sense of community and forward-thinking approach. Here are some key highlights:\n\nGeographic Significance: The primary logo of CBU features a chevron pointing to the northeast, symbolizing the university's geographic location and its forward-thinking vision.\n\nCultural and Historical Richness: CBU is not only a place for learning history but also for making it, with a student body that includes individuals from over 40 countries, enriching the campus with a vast and diverse cultural knowledge base.\n\nInnovative and Global Academic Experience: CBU pushes the boundaries of innovation and thought leadership, providing a global academic experience and focusing on building a sustainable future for its island setting.\n\nEnvironmental and Cultural Integration: Surrounded by a pristine natural landscape and vibrant culture, CBU offers a unique environment where students can engage with the community and the environment in meaningful ways.\n\nDiversity and Inclusion: The university boasts a diverse campus where students from more than 70 countries come together, creating a welcoming and inclusive environment.\n\nLeadership in Indigenous Education: CBU is a leader among Maritime institutions in delivering Mi'kmaq language courses, highlighting its commitment to indigenous education and cultural integration."}}
{"Capilano University": {"id_": "20", "university_name": "Capilano University", "abbreviation": "CapU", "website": "https://www.capilanou.ca", "wikipedia": "https://en.wikipedia.org/wiki/Capilano_University", "university_type": "Public University", "graduation_year": "4", "location": "North Vancouver, British Columbia, Canada\nSechelt, British Columbia, Canada", "graduation_rate": "0.89", "domestic_student_tuition": "CAD $6,128 - $7,946", "international_student_tuition": "CAD $521.76 per credit hour", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "description": "Capilano University, located in North Vancouver, British Columbia, Canada, is a public university primarily known for its focus on teaching and learning. Established in 1968, it offers a range of programs including undergraduate degrees, associate degrees, and diplomas in various fields such as arts, business, and sciences. The university is recognized for its small class sizes, which facilitate a more personalized learning experience. Additionally, Capilano University is noted for its strong emphasis on liberal arts education.", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "https://www.capilanou.ca/admissions/course-registration/registration-dates/academic-schedule-and-important-dates/", "statistics": "Undergraduate Programs: 97\nMaster's Programs: 0\nPhD Programs: 0", "faculty": "Faculty of Business and Professional Studies\nFaculty of Arts and Sciences", "popular_programs": "Bachelor of Business Administration\nBachelor of Early Childhood Care and Education", "programs": "Bachelor of Business Administration Degree\nContinuing Studies\n2D Animation & Visual Development\n3D Animation for Film and Games\nActing for Stage and Screen\nAdult Basic Education - General Upgrading\nAdvanced Arts & Entertainment Management\nAnimation Fundamentals\nApplied Behaviour Analysis (Autism)\nArts\nArts - Creative Writing\nBachelor of Science - General\nFine & Applied Arts\nAssociate of Arts Degree\nBachelor of Tourism Management Degree", "others": "", "characteristics": "Capilano University, originally founded as a college in 1968, has grown significantly over the years, now enrolling approximately 12,700 students annually. The university offers a diverse range of programs including 2D and 3D Animation, Acting for Stage and Screen, and a Bachelor of Tourism Management, among others. It has expanded its facilities with campuses in North Vancouver, Sechelt on the Sunshine Coast, and the newer CapU Lonsdale in 2020. Capilano University is also planning to establish a Centre for Childhood Studies, indicating a commitment to expanding its educational offerings and facilities."}}
