{"Adler Graduate Professional School": {"id_": "0", "university_name": "Adler Graduate Professional School", "abbreviation": "AGPS", "website": "https://www.adler.ca", "wikipedia": "https://en.wikipedia.org/wiki/Adler_Graduate_Professional_School", "university_type": "private graduate school", "graduation_year": "2", "location": "Toronto, Ontario, Canada", "graduation_rate": "75%", "domestic_student_tuition": "For the 2023-2024 academic year, domestic students at Adler Graduate Professional School are charged CAD $872 per credit in most programs.", "international_student_tuition": "International students can expect a tuition of approximately CAD 23,880 per academic year at Adler Graduate Professional School.", "description": "Adler Graduate Professional School, located in Toronto, Canada, is a boutique graduate school and professional education provider focusing on psychology and related fields, especially emphasizing practitioner-oriented education. It offers graduate education accreditation by the Canadian Psychological Association.", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "The 2023-2024 Academic Calendar for Adler Graduate Professional School includes important dates such as the start of the fall term on September 5, 2023, the winter term on January 8, 2024, and the spring term on May 6, 2024. Other key dates include the last day to add/drop courses, final examinations periods, and commencement ceremonies.", "statistics": "Adler Graduate Professional School, known as ADLER, is a boutique graduate school in Toronto, Canada. It offers professional graduate programs in psychology and related fields with a focus on training practitioners. The school has an intimate class size averaging around 24 people per class, and a tight-knit community of about 200 students.", "faculty": "The faculty at Adler Graduate Professional School includes leaders and practitioners in psychology, counselling, coaching, and related fields, all of whom bring real-world experience and a commitment to education.", "popular_programs": ["Master of Psychology", "Master of Psychotherapy and Spirituality", "Graduate Certificate in Coaching", "Graduate Certificate in Psychological Assessment"], "characteristics": "Adler Graduate Professional School is characterized by its focus on professional education in psychology and related fields, offering Masters and Doctoral programs. The school emphasizes experiential learning, social responsibility, and developing community-based solutions. It is located in Toronto, Canada.", "others": "Attribute not specified or available for Adler Graduate Professional School."}}
{"Alberta Business School - University of Alberta": {"id_": "0", "university_name": "Alberta Business School - University of Alberta", "abbreviation": "UAlberta School of Business", "website": "https://www.ualberta.ca", "wikipedia": "https://en.wikipedia.org/wiki/University_of_Alberta", "university_type": "public", "graduation_year": "4", "location": "The Alberta School of Business is located in Edmonton, Alberta, Canada, specifically situated within the North Campus of the University of Alberta.", "graduation_rate": "The graduation rate at the Alberta School of Business at the University of Alberta is approximately 85%.", "domestic_student_tuition": "For the 2023-2024 academic year, domestic students at the Alberta School of Business - University of Alberta pay between CAD 6,171 and CAD 8,703 for undergraduate programs, depending on the year of the program and the specific courses taken.", "international_student_tuition": "For the 2023-2024 academic year, international undergraduate students at the Alberta School of Business - University of Alberta pay approximately CAD $30,000 to $34,000 per year, depending on the program.", "description": "Alberta Business School, formally known as Alberta School of Business, is the business school of the University of Alberta located in Edmonton, Alberta, Canada. It offers undergraduate, master's, and doctoral degrees in business administration with a variety of concentrations. The school emphasizes experiential learning and global perspectives, serving as a hub for future leaders in business and policy making.", "ranking_qs_news_2024": "The Alberta School of Business at the University of Alberta is ranked between 151-200 globally in the QS World University Rankings for 2024.", "ranking_us_news_2023": "The Alberta Business School at the University of Alberta is ranked 107th in the 2023 U.S. News & World Report for Best Global Universities", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "101-150", "important_calendar": "Key dates for the Alberta School of Business at the University of Alberta for the 2023-2024 academic year include: Fall Term starts on September 1, 2023, and ends on December 8, 2023. Winter Term starts on January 8, 2024, and ends on April 12, 2024. Spring Term starts on May 6, 2024, and Summer Term begins on July 2, 2024. Other important dates include the Fall Reading Week from November 13-17, 2023, and the Winter Reading Week from February 19-23, 2024.", "statistics": "The Alberta School of Business at the University of Alberta has a rich history of excellence. Key statistics include over 30,000 alumni in more than 90 countries. The school offers programs at the undergraduate, master’s, and doctoral levels, along with executive education.", "faculty": "The faculty at the Alberta School of Business includes a diverse group of world-renowned educators and researchers. The school offers expertise across various fields such as accounting, finance, human resources, and marketing, among others.", "popular_programs": "The Alberta School of Business at the University of Alberta offers popular programs including the Bachelor of Commerce (BCom), Master of Business Administration (MBA), and PhD in Business. Specializations such as Finance, Accounting, and Strategic Management and Organization are highly regarded.", "characteristics": "The Alberta School of Business at the University of Alberta is known for its high academic standards, research contributions, and strong connections with industries which provides students with exceptional opportunities for internships and employment. The school offers a wide range of programs including Bachelor of Commerce, MBA, and PhD with specializations in areas such as finance, marketing, and strategic management. It is also noted for its commitment to sustainability and ethics in business education.", "others": "The Alberta School of Business at the University of Alberta offers a range of undergraduate, graduate, and doctoral programs. It is a research-oriented institution also known for its strong network of alumni and connection with various industries."}}
{"Algoma University": {"id_": "0", "university_name": "Algoma University", "abbreviation": "AU", "website": "https://www.algomau.ca", "wikipedia": "https://en.wikipedia.org/wiki/Algoma_University", "university_type": "public", "graduation_year": "4", "location": "Algoma University is located in Sault Ste. Marie, Ontario, Canada.", "graduation_rate": "The graduation rate at Algoma University is approximately 60%", "domestic_student_tuition": "$5,865", "international_student_tuition": "$20,000", "description": "Algoma University, located in Sault Ste. Marie, Ontario, Canada, is a small, undergraduate-only institution that offers a wide range of academic programs. The university emphasizes a personal learning experience, with a focus on undergraduate teaching and learning, and has a significant proportion of its programs dedicated to Indigenous studies.", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "The following are key dates from the Algoma University Academic Calendar: Fall term starts on September 6, Winter term starts on January 9, and Spring/Summer term starts on May 3. The Add/Drop deadline for Fall is September 20, for Winter is January 23, and for Spring/Summer is May 15. Final exams for Fall term are from December 6 to 17, for Winter from April 10 to 22, and Spring/Summer exams vary based on course schedules.", "statistics": "Algoma University has a student population of approximately 1,600, including local, domestic, and international students from over 30 countries. The university offers over 30 academic programs across various disciplines.", "faculty": "Algoma University has diverse faculties, including the School of Business and Economics, the Faculty of Science and Technology, and the Faculty of Social Work. They also offer extensive programs in Arts and Humanities.", "popular_programs": ["Business Administration", "Biology", "Computer Science", "Psychology", "Social Work"], "characteristics": "Algoma University features a personalized education, small class sizes, and is a primarily undergraduate institution. It emphasizes undergraduate teaching and learning while fostering a sense of community. Additionally, Algoma University is known for its cross-cultural learning between Indigenous populations and other communities, particularly in fields like Business Administration, Biology, and Computer Science.", "others": "attribute_prompt"}}
{"Algonquin College": {"id_": "0", "university_name": "Algonquin College", "abbreviation": "AC", "website": "https://www.algonquincollege.com", "wikipedia": "https://en.wikipedia.org/wiki/Algonquin_College", "university_type": "Public College of Applied Arts and Technology", "graduation_year": "2-3", "location": "Algonquin College is located in Ottawa, Ontario, Canada.", "graduation_rate": "66.3%", "domestic_student_tuition": "The tuition fees for domestic students at Algonquin College vary by program. For most programs, the fees range from about CAD 2,900 to CAD 4,900 per term for the 2023-2024 academic year.", "international_student_tuition": "For international students, the tuition fees at Algonquin College range from approximately CAD 13,900 to CAD 18,054 per academic year, depending on the program.", "description": "Algonquin College is a public English-language college in Ottawa, Ontario, Canada, known for offering a range of programs in Advanced Technology, Business, and Media. It also offers courses in Health and Community Studies, Hospitality and Tourism, as well as Language Training and Academic Preparation. The college was founded in 1967 and is named after the Algonquin First Nations who originally inhabited the area.", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "Algonquin College provides important academic calendar dates which include the start and end dates of classes, examination periods, drop deadlines, and holidays. These vary for Fall, Winter, and Summer semesters each year.", "statistics": "Algonquin College enrolls over 20,000 full-time students and more than 37,000 students in part-time registration. The college offers 180+ programs ranging from one-year certificates to four-year bachelor’s degrees in a variety of disciplines.", "faculty": "Algonquin College offers Faculty in the fields such as Arts and Design, Business, Health and Community Studies, Hospitality and Tourism, Media and Communication Arts, Technology and Trades, and more.", "popular_programs": ["Business Administration", "Computer Systems Technician", "Nursing"], "characteristics": "Algonquin College is a public college of applied arts and technology in Ottawa, Ontario, Canada. It is known for its technology and trades programs, as well as the variety of other programs it offers in business, health, public safety, and media and design. The college emphasizes experiential learning, with many programs offering cooperative education (co-op) opportunities, providing students with practical, hands-on experience in their field of study.", "others": "attribute_prompt"}}
{"Asper School of Business - University of Manitoba": {"id_": "0", "university_name": "Asper School of Business, University of Manitoba", "abbreviation": "ASB", "website": "https://umanitoba.ca/asper/", "wikipedia": "https://en.wikipedia.org/wiki/Asper_School_of_Business", "university_type": "Public", "graduation_year": "4", "location": "The Asper School of Business is located at the University of Manitoba in Winnipeg, Manitoba, Canada. It is situated on the Fort Garry campus at 181 Freedman Crescent.", "graduation_rate": "The graduation rate at Asper School of Business - University of Manitoba is not specifically published. However, the overall graduation rate for the University of Manitoba is approximately 72%.", "domestic_student_tuition": "For the 2023-2024 academic year, the domestic student tuition fee for the Asper School of Business at the University of Manitoba is approximately CAD $4,400 per term for full-time students.", "international_student_tuition": "The tuition fee for international students at the Asper School of Business - University of Manitoba varies depending on the number of credit hours and the particular program. As of the 2023-2024 academic year, international undergraduate students can expect to pay approximately CAD $17,760.00 based on a typical load of 30 credit hours per academic year.", "description": "The Asper School of Business at the University of Manitoba offers a robust Bachelor of Commerce (Honours) degree along with a full complement of graduate programs including: Master of Business Administration (MBA), Master of Finance (MFin), Master of Supply Chain Management and Logistics (MSCM), and PhD in Management. The school is accredited by the Association to Advance Collegiate Schools of Business.", "ranking_qs_news_2024": "The Asper School of Business - University of Manitoba does not appear to have a specific QS ranking listed for 2024 as of the available information.", "ranking_us_news_2023": "", "ranking_times_rank_2024": "601-800", "ranking_arwu_rank_2023": "", "important_calendar": "The Asper School of Business - University of Manitoba provides an academic calendar, which outlines important dates such as the start and end of classes, examination periods, breaks, and deadlines for course withdrawals. This information is vital for both students and faculty to manage schedules and plan the academic year.", "statistics": "As of 2021, Asper School of Business has over 1,800 undergraduate students, about 200 MBA students, and 20 PhD students. Also, approximately 20% of Asper graduates secure a job offer before graduation.", "faculty": "The faculty at the Asper School of Business - University of Manitoba consists of various academic departments including Accounting and Finance, Business Administration, Marketing, Supply Chain Management, and others, staffed by a diverse group of experienced educators and researchers.", "popular_programs": ["Bachelor of Commerce (Honours)", "MBA", "M.Sc. in Management"], "characteristics": "The Asper School of Business at the University of Manitoba is known for its strong focus on entrepreneurship and innovation, integration of experiential learning and engagement with the business community, offering programs at undergraduate, graduate, and doctoral levels.", "others": "For specific queries about the Asper School of Business at the University of Manitoba that do not fall under common categories such as admissions, programs, or faculty information, it is recommended to contact the school directly through their official contact points or visit their specific departments for more directed information."}}
{"Assiniboine Community College": {"id_": "0", "university_name": "Assiniboine Community College", "abbreviation": "ACC", "website": "https://assiniboine.net", "wikipedia": "https://en.wikipedia.org/wiki/Assiniboine_Community_College", "university_type": "public community college", "graduation_year": "2", "location": "Assiniboine Community College is located in Brandon, Manitoba, Canada.", "graduation_rate": "The graduation rate at Assiniboine Community College is approximately 68% to 72% for full-time, first-time diploma students.", "domestic_student_tuition": "For most programs, domestic students at Assiniboine Community College can expect tuition fees ranging from CAD 3,000 to CAD 4,000 for Canadian students, with specific amounts varying depending on the program.", "international_student_tuition": "For international students, the tuition at Assiniboine Community College varies by program. However, it generally ranges from approximately $8,000 to $16,000 CAD per academic year depending on the chosen program.", "description": "Assiniboine Community College, located in Manitoba, Canada, offers over 40 diverse programs across a variety of fields including agriculture, food, business, health, and human services. The college is known for its practical, hands-on approach to education, preparing students with the skills and knowledge they need to succeed in their chosen careers.", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "Assiniboine Community College does not appear in the Times Higher Education rankings for 2024.", "ranking_arwu_rank_2023": "", "important_calendar": "Assiniboine Community College's important academic calendar includes key dates such as the start of the fall term on September 5, the winter term on January 3, and the spring/summer term depending on the program. Other significant dates include the last day to drop courses with a refund, and the final exam periods for each term.", "statistics": "Assiniboine Community College has an annual enrollment of approximately 3,700 full-time and 4,300 part-time students. The college offers over 40 diploma and certificate programs across a range of industries.", "faculty": "The faculty at Assiniboine Community College comprises experts from various disciplines, including agriculture, environment, business, and health, among others. The faculty members are known for their dedication to providing hands-on and experiential learning opportunities.", "popular_programs": ["Practical Nursing", "Agribusiness", "Culinary Arts", "Network Administration Technology", "Early Childhood Education"], "characteristics": "Assiniboine Community College offers diverse programs in agriculture, environment, business, health and human services, and trades and technology. It is known for its hands-on learning experiences, small class sizes and a strong connection with industries.", "others": "attribute_prompt"}}
{"Athabasca University": {"id_": "0", "university_name": "Athabasca University", "abbreviation": "AU", "website": "https://www.athabascau.ca", "wikipedia": "https://en.wikipedia.org/wiki/Athabasca_University", "university_type": "Online university", "graduation_year": "4", "location": "Athabasca University is located in Athabasca, Alberta, Canada, with learning centres in Calgary and Edmonton.", "graduation_rate": "8.3%", "domestic_student_tuition": "$6,090 - $7,840", "international_student_tuition": "$10,950 - $17,470", "description": "Athabasca University is an open university wholly dedicated to online and distance education, based in Athabasca, Alberta, Canada. Founded in 1970, the university provides online courses for undergraduate and graduate students.", "ranking_qs_news_2024": "Athabasca University is not listed in the QS World University Rankings for 2024.", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "Fall 2023 semester starts on September 1, 2023 for students enrolled in undergraduate programs. Assignments are typically due on Sundays throughout the semester, with an Exam Week set from December 11-15, 2023. The Winter 2024 semester begins on January 4, 2024. For full and detailed schedules, students should consult the Academic Schedule section on the university's official website.", "statistics": "Athabasca University, as of 2021, serves over 40,000 students with more than 850 faculty members. The university offers more than 900 courses in 55 degree, diploma, and certificate programs.", "faculty": "Athabasca University has four faculties: Faculty of Business, Faculty of Health Disciplines, Faculty of Humanities & Social Sciences, and Faculty of Science & Technology.", "popular_programs": "Bachelor of Science, Bachelor of Commerce, Bachelor of Arts, Bachelor of Nursing, and Master of Business Administration (MBA)", "characteristics": "Athabasca University is a public university in Alberta, Canada, known for its focus on distance education and online courses. It allows students to start their courses at any point throughout the year, not being bound to traditional semester schedules. The university is also recognized for its flexible approach to learning and its accessibility, enabling students to balance their studies with personal or professional commitments.", "others": "attribute_prompt"}}
{"Beedie School of Business - Simon Fraser University": {"id_": "0", "university_name": "Beedie School of Business - Simon Fraser University", "abbreviation": "BSB", "website": "https://beedie.sfu.ca", "wikipedia": "https://en.wikipedia.org/wiki/Beedie_School_of_Business", "university_type": "public", "graduation_year": "4", "location": "The Beedie School of Business is part of Simon Fraser University, which has three campuses located in Burnaby, Surrey, and Vancouver, British Columbia, Canada. The business school primarily operates from the Burnaby and Vancouver campuses.", "graduation_rate": "The graduation rate at Beedie School of Business at Simon Fraser University is approximately 79%.", "domestic_student_tuition": "For the 2023/2024 academic year, the domestic student tuition fee for the Beedie School of Business at Simon Fraser University is approximately CAD $7,227.10 per term for a full-time course load.", "international_student_tuition": "Tuition fees for international students at the Beedie School of Business vary depending on the program and the number of credits taken. For most undergraduate programs, fees are calculated on a per-unit basis, with the average per-unit cost being approximately CAD 874.49 for the 2021-2022 academic year. This amounts to around CAD 20,987.76 per year for a full-time student taking 24 units.", "description": "The Beedie School of Business is a faculty of Simon Fraser University located in Burnaby, British Columbia, Canada. It is known for its wide array of undergraduate, graduate, and executive education programs in business and management studies. The school has been accredited by AACSB and EQUIS, and it has significant recognition for its contributions to research and community engagement.", "ranking_qs_news_2024": "The QS World University Rankings for 2024 have not been released yet as the 2023 rankings are the most current available.", "ranking_us_news_2023": "The Beedie School of Business - Simon Fraser University is ranked #251-300 in the world in the QS World University Rankings for 2023.", "ranking_times_rank_2024": "601-800", "ranking_arwu_rank_2023": "501-600", "important_calendar": "The academic calendar for Beedie School of Business at Simon Fraser University includes important dates such as the start and end of each semester, examination periods, and official holidays. The Fall semester typically begins in September and ends in December, while the Spring semester starts in January and concludes in April. Summer sessions may also be available.", "statistics": "As of the latest data, Beedie School of Business at Simon Fraser University has about 3,800 undergraduate students, 250 MBA and graduate students, and employs more than 120 faculty members. The school offers numerous programs including BBA, MBA, EMBA, MSc Finance, and Ph.D.", "faculty": "The Beedie School of Business at Simon Fraser University has a diverse faculty with a strong focus on research, innovation, and business education. The school's faculty are not only committed to academic excellence but also to creating an impact in the business world through consulting, research and community engagement.", "popular_programs": ["Bachelor of Business Administration (BBA)", "Master of Business Administration (MBA)", "Executive MBA", "Master of Science in Finance"], "characteristics": "The Beedie School of Business at Simon Fraser University is known for its strong emphasis on experiential learning, diverse degree programs, and global business perspective. It offers both undergraduate and graduate programs, including a notable Executive MBA and an MBA program with various specializations such as Management of Technology. The school has a strong focus on research and innovation, as well as a commitment to sustainability and social responsibility in business education.", "others": "The Beedie School of Business is the business school of Simon Fraser University located in Burnaby, British Columbia, Canada. It offers undergraduate, graduate, and PhD programs in business administration, as well as executive education and other non-degree programs. The school's strengths include international business, innovation, and entrepreneurship."}}
{"Bishop's University": {"id_": "0", "university_name": "Bishop's University", "abbreviation": "BU", "website": "https://www.ubishops.ca", "wikipedia": "https://en.wikipedia.org/wiki/Bishop%27s_University", "university_type": "Public liberal arts university", "graduation_year": "4", "location": "Bishop's University is located in Sherbrooke, Quebec, Canada.", "graduation_rate": "The six-year graduation rate at Bishop's University is approximately 70%.", "domestic_student_tuition": "The tuition fee for domestic students at Bishop's University varies based on program and course load, but typical full-time undergraduate tuition for Quebec residents is approximately $2,943 per year. For non-Quebec Canadian residents, the fee is around $8,434 per year.", "international_student_tuition": "CAD 21,246 per academic year for most undergraduate programs", "description": "Bishop's University is a primarily undergraduate university in Lennoxville, a borough of Sherbrooke, Quebec, Canada. It is one of the smallest universities in Canada, focusing on liberal arts education. Bishop's University provides a personalized education experience in a close-knit community setting.", "ranking_qs_news_2024": "", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "", "important_calendar": "Bishop's University provides academic calendars which include important dates such as start of classes, holidays, exam periods, and other key events. These dates can change annually, so it is recommended to visit the university's official site for the most current calendar.", "statistics": "As of 2021 statistics for Bishop's University include around 2,900 full-time students, with a student to faculty ratio of about 18:1. The university offers more than 100 different programs across three faculties: Humanities, Social Sciences, and Natural Sciences & Mathematics.", "faculty": "Bishop's University has a faculty staff that includes esteemed professors across various disciplines such as liberal arts, science, business, and education. The specific number of faculty members varies, but the university maintains a low student-to-faculty ratio to ensure personalized and focused educational experiences.", "popular_programs": "Business Administration, Computer Science, Psychology, and Elementary Education", "characteristics": "Bishop’s University features a largely residential campus with predominantly full-time students. It's known for its intimate and engaging liberal arts community, focusing on interactive and personalized learning experiences. The university also prides itself on small class sizes and a connectedness between faculty members and students.", "others": "attribute_prompt"}}
{"Bow Valley College": {"id_": "0", "university_name": "Bow Valley College", "abbreviation": "BVC", "website": "https://www.bowvalleycollege.ca", "wikipedia": "https://en.wikipedia.org/wiki/Bow_Valley_College", "university_type": "Public college", "graduation_year": "2", "location": "Bow Valley College is located in Calgary, Alberta, Canada.", "graduation_rate": "67%", "domestic_student_tuition": "For domestic students at Bow Valley College, the tuition fees may vary depending on the program. As of the academic year 2022, tuition may range generally from approximately CAD 3,845 to CAD 7,365 for most programs per year. Notably, certain programs or courses could have different fees.", "international_student_tuition": "For international students, tuition fees at Bow Valley College vary by program. For the 2023-2024 academic year, the approximate cost for international students ranges from CAD $6,420 to CAD $22,704 per term depending on the chosen program.", "description": "Bow Valley College is a public community college specializing in delivering quality, adult education programming since 1965. Located in Calgary, Alberta, Canada, it offers career programs in a variety of areas including business, health, human services, and technology, designed to help learners secure employment in the current workforce.", "ranking_qs_news_2024": "Bow Valley College does not appear in the QS World University Rankings for 2024.", "ranking_us_news_2023": "", "ranking_times_rank_2024": "", "ranking_arwu_rank_2023": "Not applicable", "important_calendar": "The important dates and calendar for Bow Valley College include academic schedule, application deadlines, fee deadlines, exam schedules, and holidays. Specific details and dates vary each year and are updated on their official website.", "statistics": "Bow Valley College in Calgary, Alberta, Canada, has approximately 15,000 students including full-time, part-time, and international students. The college offers career programs leading to one-year certificates, two-year diplomas, and post-diploma certificates.", "faculty": "Bow Valley College has diverse faculty members spread across multiple schools such as the Chiu School of Business, the School of Community Studies, the School of Creative Technologies, the School of Global Access, the School of Health and Wellness, and the School of Foundational Learning.", "popular_programs": ["Practical Nursing", "Justice Studies", "Early Learning and Child Care"], "characteristics": "Bow Valley College is a public, board-governed college operating as a comprehensive community institution under the Post-Secondary Learning Act of Alberta. Its main campus is located in Calgary, Alberta, Canada. Known for its practical learning approach, the college offers a variety of diploma, certificate, and degree programs primarily focusing on practical skills. It serves over 17,000 students and is recognized for its strong focus on helping learners transition to the workforce.", "others": "attribute_prompt"}}
{"UW": {"id_": "0", "university_name": "University of Waterloo", "abbreviation": "UW stands for University of Waterloo.", "website": "https://uwaterloo.ca", "wikipedia": "https://en.wikipedia.org/wiki/University_of_Waterloo", "university_type": "Public", "graduation_year": "4", "location": "The University of Waterloo is located in Waterloo, Ontario, Canada.", "graduation_rate": "The six-year graduation rate for University of Waterloo is 86%", "domestic_student_tuition": "For undergraduate programs, domestic students at the University of Waterloo (UW) face tuition fees ranging from approximately CAD 6,000 to CAD 15,000 per year, varying by program.", "international_student_tuition": "Undergraduate international students at University of Waterloo (UW) will have tuitions ranging from approximately CAD 45,000 to CAD 67,600 for most programs in the 2023-2024 academic year.", "description": "The University of Waterloo, also known as UW, is located in Waterloo, Ontario, Canada. It is renowned for its cooperative education (co-op) programs, which are the largest internationally and help students integrate their education with applicable work experiences. The university offers academic programs administered by six faculties and thirteen faculty-based schools. UW also lays claim to being a leader in innovation in Canada.", "ranking_qs_news_2024": "The University of Waterloo is ranked #204 in QS World University Rankings for 2024.", "ranking_us_news_2023": "6", "ranking_times_rank_2024": "34", "ranking_arwu_rank_2023": "45", "important_calendar": "The important academic dates for the University of Waterloo can be found at: https://uwaterloo.ca/important-dates/calendar", "statistics": "The University of Waterloo (UW) is recognized for its significant impact on innovation in Canada, with key statistics highlighting its large co-operative education program and strong ties to industry. It has an enrollment of over 30,000 full and part-time students participating in a variety of undergraduate and graduate programs.", "faculty": "The University of Waterloo has six faculties: the Faculty of Arts, the Faculty of Engineering, the Faculty of Environment, the Faculty of Health, the Faculty of Mathematics, and the Faculty of Science.", "popular_programs": ["Computer Science", "Business Administration (Laurier) and Computer Science (UW) Double Degree", "Software Engineering", "Mechatronics Engineering", "Biomedical Engineering"], "characteristics": "The University of Waterloo (UW) is renowned for its co-operative education (co-op) programs, which allow students to integrate academic studies with work experiences. It has a strong emphasis on research, innovation, and entrepreneurship, underpinned by faculties such as Engineering, Mathematics, and Computer Science. The university fosters a collaborative environment with state-of-the-art facilities and is a hub for technological advancement.", "others": "attribute_prompt"}}
{"UofT": {"id_": "0", "university_name": "University of Toronto", "abbreviation": "U of T", "website": "https://www.utoronto.ca", "wikipedia": "https://en.wikipedia.org/wiki/University_of_Toronto", "university_type": "public", "graduation_year": "4", "location": "The University of Toronto (UofT) is located in Toronto, Ontario, Canada.", "graduation_rate": "The graduation rate at the University of Toronto is around 87%.", "domestic_student_tuition": "For domestic students, the tuition fees at the University of Toronto vary across programs. For the 2022-2023 academic year, arts and science undergraduate programs have a tuition fee of approximately CAD 6,100 for Canadian students.", "international_student_tuition": "The tuition fee for international undergraduate students at the University of Toronto varies by program, ranging approximately from CAD 45,690 to CAD 59,530 for the academic year 2022-2023.", "description": "The University of Toronto (UofT), located in Ontario, Canada, is a public research university founded by royal charter in 1827 as King's College. It was initially controlled by the Church of England and became the first institution of higher learning in Upper Canada. Today, the University of Toronto is recognized globally for its significant contributions to research and education, having various campuses including St. George, Scarborough, and Mississauga.", "ranking_qs_news_2024": "The University of Toronto (UofT) is ranked 24th in the QS World University Rankings 2024.", "ranking_us_news_2023": "16", "ranking_times_rank_2024": "24", "ranking_arwu_rank_2023": "21", "important_calendar": "The University of Toronto provides a comprehensive important dates calendar for the academic year 2023-2024. Key dates include the start of fall term classes on September 7, 2023, winter break from December 21, 2023 to January 5, 2024, and the end of winter term lectures on April 8, 2024.", "statistics": "The University of Toronto (UofT) has three campuses: St. George, Scarborough (UTSC), and Mississauga (UTM). It enrolls over 93,000 students, of which 23% are international. UofT offers over 700 undergraduate programs and 280 master's and doctoral programs.", "faculty": "The University of Toronto has 16 faculties and schools including: Faculty of Arts & Science, John H. Daniels Faculty of Architecture, Landscape, and Design, Faculty of Applied Science & Engineering, Faculty of Music, Faculty of Forestry, Faculty of Information, Faculty of Medicine, Faculty of Nursing, Faculty of Pharmacy, Faculty of Dentistry, Dalla Lana School of Public Health, Ontario Institute for Studies in Education, Rotman School of Management, School of Graduate Studies, Faculty of Law, and Faculty of Social Work.", "popular_programs": "Some of the popular programs at the University of Toronto include Computer Science, Life Sciences, Engineering, Business, and Psychology.", "characteristics": "The University of Toronto (UofT) is known for its intensive research activities, high academic standards, and significant contributions to Canadian innovation and culture. It offers a wide range of undergraduate and graduate programs, boasts a significant number of extracurricular opportunities, and has a notable global outreach.", "others": "attribute_prompt"}}
{"University Of British Columbia": {"id_": "0", "university_name": "University Of British Columbia", "abbreviation": "UBC", "website": "https://www.ubc.ca", "wikipedia": "https://en.wikipedia.org/wiki/University_of_British_Columbia", "university_type": "public research", "graduation_year": "4", "location": "The University of British Columbia has two main campuses: the Vancouver campus, located at 2329 West Mall, Vancouver, BC V6T 1Z4, Canada, and the Okanagan campus, situated at 3333 University Way, Kelowna, BC V1V 1V7, Canada.", "graduation_rate": "The six-year graduation rate for UBC is approximately 79.7% for domestic students and 69.1% for international students.", "domestic_student_tuition": "For the 2022/2023 academic year, the domestic student tuition at the University of British Columbia ranges typically between CAD $5,506 and CAD $7,944 for most undergraduate programs per year.", "international_student_tuition": "For the 2023/2024 academic year, international undergraduate students at the University of British Columbia can expect to pay between CAD $45,929 and CAD $52,743 in tuition fees, depending on their program of study.", "description": "The University of British Columbia (UBC), located in British Columbia, Canada, is a public university known for its excellence in research and teaching. Established in 1908, UBC is a member of the U15 Group of Canadian Research Universities and offers a wide range of programs across its Vancouver and Okanagan campuses.", "ranking_qs_news_2024": "34", "ranking_us_news_2023": "35th among global universities", "ranking_times_rank_2024": "37", "ranking_arwu_rank_2023": "38", "important_calendar": "The University of British Columbia publishes its Academic Calendar online which includes important dates such as the start and end of term, holidays, and exam periods for both the Vancouver and Okanagan campuses.", "statistics": "The University of British Columbia enrolls over 66,000 students, with approximately 58,000 undergraduate and 10,000 graduate students across its Vancouver and Okanagan campuses. UBC's total endowment is around CAD 2.2 billion, making it one of the largest among Canadian universities.", "faculty": "UBC has 16 faculties including the Faculty of Arts, Science, Applied Science, UBC Sauder School of Business, and Faculty of Medicine among others. Each faculty provides a broad array of programs and engaging environments for learning and research.", "popular_programs": ["Business and Economics", "Engineering and Technology", "Science", "Arts and Humanities", "Medicine", "Environmental Science"], "characteristics": "The University of British Columbia (UBC) is characterized by its strong emphasis on research, innovation, and sustainability. It offers a diverse range of undergraduate and graduate programs and is known for its beautiful campuses in Vancouver and Kelowna. UBC is also recognized for its commitment to inclusivity and global engagement.", "others": "attribute_prompt"}}
{"University of Calgary": {"id_": "0", "university_name": "University of Calgary", "abbreviation": "U of C", "website": "https://www.ucalgary.ca", "wikipedia": "https://en.wikipedia.org/wiki/University_of_Calgary", "university_type": "Public Research University", "graduation_year": "4", "location": "The University of Calgary is located in Calgary, Alberta, Canada.", "graduation_rate": "The graduation rate at the University of Calgary is approximately 70%", "domestic_student_tuition": "$6,961", "international_student_tuition": "$26,849", "description": "The University of Calgary, located in Calgary, Alberta, Canada, is a public research university. It began as a branch of the University of Alberta in 1944 before being instituted into a separate, autonomous university in 1966. It belongs to the U15, a group of research-intensive universities in Canada.", "ranking_qs_news_2024": "The University of Calgary has been ranked 201-250 in the QS World University Rankings for 2024.", "ranking_us_news_2023": "178", "ranking_times_rank_2024": "Not available yet", "ranking_arwu_rank_2023": "201-300", "important_calendar": "The University of Calgary's Academic Calendar provides important information including admissions requirements, academic regulations, programs of study, courses, and additional university policies. The calendar for the 2023-2024 school year is accessible online and includes the most up-to-date academic and administrative information.", "statistics": "The University of Calgary has approximately 33,000 students enrolled across its undergraduate, graduate, and professional programs. Moreover, it hosts over 1,800 academic staff members dedicated to research and teaching. The university also proudly reports receiving $480 million in sponsored research revenue, indicating a strong emphasis on research excellence.", "faculty": "The University of Calgary has faculties including the Cumming School of Medicine, Schulich School of Engineering, Faculty of Science, Faculty of Arts, Haskayne School of Business, Faculty of Social Work, Faculty of Law, Faculty of Nursing, Werklund School of Education, and Faculty of Veterinary Medicine.", "popular_programs": ["Engineering", "Business", "Biological Sciences", "Computer Science", "Economics"], "characteristics": "The University of Calgary is known for its high research activity, diverse programs, and strong connections with the community. It offers more than 250 programs across various disciplines and is a member of the U15 Group of Canadian Research Universities. The university emphasizes experiential learning and innovative teaching approaches, and it hosts a variety of specialized research institutes and centers.", "others": "attribute_prompt"}}
